{
  "backend/main.mo": "Defines resident-related data types and comparison helpers, and includes authorization and storage mixins in an actor canister.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend components, hooks, dialogs, and utilities.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Primary production deployment checklist covering verification steps, manual and scripted deploy flows, and troubleshooting guidance.",
  "frontend/deployment_logs/.gitkeep": "Documentation for the deployment logs directory describing generated log and canister ID files and their purpose.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment checklist specific to Version 89 with publish-only steps and limited smoke tests.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the frontend root and main TypeScript module.",
  "frontend/public/build-meta.json": "Placeholder build metadata file overwritten during deployment.",
  "frontend/scripts/clean_redeploy_production.sh": "Cleans build artifacts, injects metadata, rebuilds the frontend, and redeploys to production with logging.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for retrying version 89 publish-only deployment to the IC network.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive script guiding operators through post-deployment smoke tests and verifying artifacts.",
  "frontend/scripts/redeploy_production.sh": "Rebuilds the frontend with metadata and redeploys to production, logging repository state and canister IDs.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed post-deployment smoke test instructions for Version 89 including authentication, dashboard loading, and error checks.",
  "frontend/src/App.tsx": "Main React app handling authentication, actor initialization, startup health checks, and routing.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for adding an ADL record, collecting date, activity, assistance level, and notes, then submitting via useAddAdlRecord. Handles validation, reset, and toast errors.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog for recording daily vitals including temperature, blood pressure, pulse, respiration, oxygen saturation, and optional glucose. Converts units, validates fields, and submits via useAddDailyVitals.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog to log medication administration by selecting an active medication and entering time, administrator, and notes. Submits a MAR record using useAddMarRecord.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog for adding a new medication with dosage, route, schedule, prescribing physician, and notes. Splits administration times and submits via useAddMedication.",
  "frontend/src/components/AddResidentDialog.tsx": "Large admin‑gated dialog for creating a new resident with personal info, room data, physicians, pharmacy, insurance, and responsible persons. Supports multi-entry lists and submits via useAddResident.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog form for submitting a new weight entry for a resident, handling validation, unit selection, notes, and backend mutation submission.",
  "frontend/src/components/BrandLogo.tsx": "Displays the Moritz Care Home logo with size/mode options and a text fallback if the image fails to load.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Shows frontend build info and backend canister ID with fallback logic and warnings when metadata is missing or unavailable.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing an existing medication with pre‑filled fields, physician lookup, and submission to update backend data.",
  "frontend/src/components/EditResidentDialog.tsx": "Comprehensive resident editing dialog including personal info, physicians, pharmacy, insurance, and responsible persons with admin access checks.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form allowing a user to save their name and employee ID through a backend mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "File exists but contains no implementation content.",
  "frontend/src/components/StartupErrorScreen.tsx": "A UI component that displays startup errors with diagnostics, authentication info, and retry/logout controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, status tracking, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and updating user profiles and other backend data, with startup-safe and timeout-aware variants.",
  "frontend/src/hooks/useResilientActor.ts": "Builds a fault-tolerant backend actor with timeouts and optional admin-token initialization, exposing status and retry controls.",
  "frontend/src/index.css": "Tailwind CSS base setup defining light/dark themes, dialog overrides, and print-specific layout and styling rules.",
  "frontend/src/lib/actorInit.ts": "Provides timeout-wrapped promises and helpers to classify backend, network, and timeout errors.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe asset URLs using Vite’s BASE_URL with cleanup of slashes.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build/version metadata from env vars or a fallback file and generates build identifiers.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to/from backend nanoseconds and provides formatting and age calculation utilities.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps RoomType and ResidentStatus enums to/from UI string values with backward-compatible helpers.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend diagnostics and performs a timeout-protected health check on the canister.",
  "frontend/src/lib/startupTimings.ts": "Defines central timeout constants for various startup operations.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing active and discharged residents with admin-only discharge/delete actions and error retry states.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with a styled card, background image, and loading state.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page fetching detailed resident data with admin-gated editing, multiple record dialogs, and retry/error handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings for the project UI theme.",
  "project_state.json": "Project state metadata describing authorization issues, pending feature requests, and architectural notes."
}