{
  "backend/main.mo": "Defines the main backend actor with authorization and storage mixins plus extensive resident, physician, medication, and related type definitions including comparison helpers.",
  "feature_evidence.json": "Empty feature evidence report with no features listed.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, hooks, pages, and styles.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Production deployment checklist detailing verification steps, deployment methods, logging, rollback workflow, and clean rebuild procedures.",
  "frontend/deployment_logs/.gitkeep": "Describes the purpose of the deployment logs directory and the types of log and metadata files generated by deployment scripts.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment checklist for Version 89 covering manual deployment, retry script usage, and smoke-test requirements.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global border, background, and text styles.",
  "frontend/index.html": "Basic HTML entry file mounting the app root and loading main.tsx.",
  "frontend/public/build-meta.json": "Placeholder build metadata file overwritten during deployment.",
  "frontend/scripts/clean_redeploy_production.sh": "Performs a clean frontend rebuild by deleting caches and dist output, injects build metadata, then redeploys to the IC with logging.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for retrying the version‑89 publish‑only deployment, building the frontend and deploying to the IC.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive script guiding operators through post‑deployment smoke tests and verifying deployment artifacts.",
  "frontend/scripts/redeploy_production.sh": "Rebuilds the frontend with injected metadata and redeploys it to the IC, logging repository state and canister IDs.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed post-deployment smoke test instructions for Version 89 covering login, authentication, dashboard load, and error monitoring.",
  "frontend/src/App.tsx": "Main React app wiring authentication, backend actor initialization, user profile fetching, health checks, and routing.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for adding a resident’s ADL record, handling date, activity, assistance level, notes, and mutation submission.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog for entering daily vital signs including temperature, blood pressure, pulse, respiration, oxygen levels, and submitting via mutation.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog to record medication administration for a resident, selecting active meds and submitting time, staff, and notes.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog for adding a new medication to a resident, capturing dosage, route, times, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Comprehensive admin‑only dialog to add a new resident with personal data, room info, physicians, pharmacy, insurance, and responsible persons.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog to add a resident weight entry with form fields, validation, and mutation submission.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with size and mode options and a text fallback if the image fails to load.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Shows frontend build info and backend canister ID with fallback loading and warning indicators.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing an existing medication with pre-filled values, validation, and update mutation.",
  "frontend/src/components/EditResidentDialog.tsx": "Large admin‑gated form for editing all resident details with pre-filled data and multi-section inputs.",
  "frontend/src/components/ProfileSetup.tsx": "Initial user profile setup form capturing name and employee ID and saving via mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a detailed startup error screen with error details, backend diagnostics, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login/logout, and restores identities using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles and related data, including startup-safe variations using the resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a fault-tolerant backend actor with timeouts and optional admin initialization, avoiding auto-retry during startup.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, dialog overrides, and print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Provides promise timeout handling and helpers to classify backend, network, and timeout errors.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite base paths and cleans double slashes.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata from env or fallback file and constructs build identifiers.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to/from backend nanoseconds and provides formatting and age calculation utilities.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps RoomType and ResidentStatus enums to and from string values used in the UI.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend diagnostics and runs a timeout‑protected health check against the canister.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized startup timeout constants for actor creation and data loading.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing active/discharged residents with admin-only discharge/delete actions and error-handled data fetching.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with a styled card and background image.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page displaying detailed info, medication management, and admin-gated editing with loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings.",
  "project_state.json": "Project metadata describing missing backend authorization modules and related restoration tasks."
}