{
  "backend/main.mo": "Defines the backend actor with authorization and storage mixins and comprehensive types plus comparison utilities for residents and related entities.",
  "feature_evidence.json": "Lists feature evidence entries, each detailing feature goals, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files, summarizing their roles, features, and recent behavior changes.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Main production deployment guide outlining verification steps, deployment methods, logging, and rollback procedures.",
  "frontend/deployment_logs/.gitkeep": "Placeholder file documenting that the directory stores timestamped deployment logs and canister ID artifacts.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment checklist for Version 89 with instructions for building, deploying, and performing smoke tests.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file initializing the frontend root and loading the main TypeScript entrypoint.",
  "frontend/public/build-meta.json": "Template metadata file overwritten during deployment with version, commit, and timestamp data.",
  "frontend/scripts/clean_redeploy_production.sh": "Script that performs a clean frontend rebuild, injects build metadata, and redeploys to production with logging.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for retrying a version‑89‑specific publish-only deployment to the IC.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive script guiding operators through post-deployment smoke tests and verifying deployment artifacts.",
  "frontend/scripts/redeploy_production.sh": "Script that rebuilds the frontend with metadata and redeploys it to production, logging canister IDs and repo state.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed smoke test plan for Version 89 covering authentication, dashboard behavior, UI checks, and error monitoring.",
  "frontend/src/App.tsx": "Main app sets up routing, identity, actor loading, and multi-stage startup health checks with timeouts and fallback screens.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for creating an ADL record, validating fields and submitting via useAddAdlRecord.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog to record daily vitals with date/time parsing, temperature unit handling, and mutation submission.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for adding a MAR entry, selecting active medications, converting date/time, and submitting via useAddMarRecord.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog for adding a medication to a resident, including dosage, route, schedule, and physician matching.",
  "frontend/src/components/AddResidentDialog.tsx": "Large admin-only form for creating residents, handling basic info plus lists of physicians, pharmacy, insurance, and responsible persons. Manages extensive local state and submits mapped values to backend.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a weight entry to a resident, validating required fields and submitting measurement data to the backend. Includes simple form state and reset logic.",
  "frontend/src/components/BrandLogo.tsx": "Displays the app’s logo with size and mode options and provides a text fallback if the image fails to load. Uses asset URL resolution and minimal state.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Shows build metadata and backend canister ID with fallbacks and warning indicators when information is missing. Uses tooltips and runtime checks for build diagnostics.",
  "frontend/src/components/EditMedicationDialog.tsx": "Form dialog for editing an existing medication with pre-filled values, supporting route, quantity, prescribing physician lookup, and status updates. Submits updated fields to backend with validation and toasts.",
  "frontend/src/components/EditResidentDialog.tsx": "Comprehensive admin-only editor for all resident details with pre-filled data and multi-section editing for physicians, pharmacy, insurance, and responsible persons. Converts form values to backend formats and updates the resident record.",
  "frontend/src/components/ProfileSetup.tsx": "Form component letting users enter and save name and employee ID using a startup-safe profile mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays startup errors with diagnostics, error details, and retry/logout controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines startup-safe and normal user profile queries and mutations using actor/resilient‑actor hooks with timeout and error handling.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a timeout-protected actor with optional admin initialization and surfaces errors for controlled retry behavior.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, dialog overrides, and extensive print styles.",
  "frontend/src/lib/actorInit.ts": "Provides timeout wrapping, canister error detection, and error normalization helpers for backend communication.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe asset URLs using Vite’s BASE_URL with normalization to avoid double slashes.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata from env vars or a fallback file and generates build identifiers.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to/from nanoseconds and provides formatting and age calculation utilities using UTC-safe logic.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps room type and resident status enums between backend values and frontend string representations.",
  "frontend/src/lib/startupDiagnostics.ts": "Derives backend environment diagnostics and performs a health check via the public backend endpoint.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeout constants for various startup and backend interaction operations.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with React Query and Internet Identity providers, and renders App.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing active and discharged residents with admin actions, query-driven data loading, and confirmation dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that triggers Internet Identity authentication and displays a styled login card with branding.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page that loads resident data, supports admin editing actions, and displays detailed info across tabs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, container settings, animations, and plugins.",
  "project_state.json": "Metadata file describing project state, known issues, and feature requests for fixing dashboard loading behavior."
}