{
  "backend/main.mo": "Main actor defining resident-related types and comparison utilities, integrating authorization, storage mixins, and migration support.",
  "backend/migration.mo": "Module defining legacy and new actor state structures for safe upgrades, including all resident‑related types and ID counters.",
  "feature_evidence.json": "Placeholder feature evidence report with an empty features list.",
  "frontend-file-summaries.txt": "Text file listing high‑level summaries of all frontend source files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Primary production deployment checklist covering verification steps, deployment methods, logging, and rollback guidance.",
  "frontend/deployment_logs/.gitkeep": "Placeholder file describing the purpose and contents of the deployment logs directory.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment checklist specific to Version 89 with manual steps, retry script notes, and smoke‑test requirements.",
  "frontend/index.css": "Tailwind CSS configuration defining base styles, color variables, and theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the frontend root element and main TypeScript module.",
  "frontend/public/build-meta.json": "Template metadata file overwritten during deployment with build version, commit, and timestamp.",
  "frontend/scripts/clean_redeploy_production.sh": "Script performing a clean rebuild and redeploy of the frontend with logging and build metadata injection.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Legacy script for rebuilding and deploying Version 89 only, including canister ID extraction.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive CLI script guiding operators through smoke tests and validating deployment artifacts.",
  "frontend/scripts/redeploy_production.sh": "Automates production frontend rebuild and deployment to the IC network, logging actions and capturing canister IDs.",
  "frontend/scripts/restart_backend_canister.sh": "Checks backend canister status on the IC network and starts or restarts it depending on the provided mode.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed smoke test checklist for verifying core app functionality after deploying Version 89.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, routing, and startup diagnostics including health checks and timeout logic.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for submitting ADL records for a resident, validating fields and sending data through a mutation.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog form for entering daily vitals for a resident, converting inputs and submitting via mutation.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog form for recording medication administration, selecting active medications and submitting the record.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog form allowing users to add a medication to a resident, including dosage, route, times, and physician matching with submission via useAddMedication.",
  "frontend/src/components/AddResidentDialog.tsx": "Large admin‑gated dialog for creating residents with multi-section forms for personal info, physicians, insurance, pharmacy, and responsible persons.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a weight entry to a resident, converting dates to nanoseconds and submitting using useAddWeightEntry.",
  "frontend/src/components/BrandLogo.tsx": "Component that displays a logo image with size and mode options and falls back to text if the image fails to load.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Indicator showing frontend build info and backend canister ID with fallback handling for missing metadata and tooltip diagnostics.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing an existing medication with prefilled fields, physician resolution, and update submission via useUpdateMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large admin-only form dialog for editing all resident fields, including physicians, pharmacy, insurance, and responsible persons with prefill and update submission.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form that saves the caller’s name and employee ID using a startup mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays detailed startup errors, diagnostics, and retry/logout controls, including special handling for stopped backend canisters.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context, loading stored identities, and handling Internet Identity login and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for registration, profile loading, and other backend interactions using resilient actors and timeouts.",
  "frontend/src/hooks/useResilientActor.ts": "React hook that initializes a backend actor with timeouts, optional admin token setup, and resilient error handling via React Query.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark theme variables, dialog overrides, and detailed print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Utilities for wrapping promises with timeouts and classifying backend errors such as stopped canisters, missing canisters, network failures, and timeouts.",
  "frontend/src/lib/assetUrl.ts": "Generates normalized asset URLs using Vite’s base path while preventing duplicate slashes.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata from environment variables or a fallback file and constructs version/identifier strings for different environments.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to and from backend nanosecond timestamps and provides formatting and age-calculation helpers without timezone distortion.",
  "frontend/src/lib/registrationErrorMapping.ts": "Maps backend registration errors to user-friendly messages and detects anonymous or provisioning-related errors.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps RoomType and ResidentStatus enums to strings and back, including backward-compatibility aliases.",
  "frontend/src/lib/startupDiagnostics.ts": "Provides backend diagnostics extraction and a timeout-protected backend health check.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized startup timeout constants for various frontend operations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard showing active and discharged residents with admin actions, loading states, and retry handling.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with a branded UI and loading state.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page with admin-gated editing, multiple record dialogs, and retryable data fetch.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color palette, layout settings, shadows, and animation keyframes.",
  "project_state.json": "JSON metadata describing project state, known issues, and pending feature requests related to adding an admin principal."
}