{
  "backend/main.mo": "Defines the main canister actor with authorization, storage mixins, and an extensive set of resident‑related types plus comparison utilities.",
  "backend/migration.mo": "Implements a migration module that filters and sanitizes resident data while preserving the full legacy state structure.",
  "feature_evidence.json": "Empty feature‑evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for documentation or build tooling.",
  "frontend/index.css": "Global Tailwind base layer defining OKLCH color variables, themes, and default element styling.",
  "frontend/index.html": "Minimal HTML entry point that loads the React application root and main script.",
  "frontend/src/App.tsx": "Main React app handling authentication, resilient actor initialization, profile gating, and routing via TanStack Router.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for adding ADL records with predefined activity and assistance options, validating inputs and submitting to backend.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component providing a form to record daily vital signs for a resident and submit them via a mutation.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Form dialog for adding a medication administration record for a resident, including medication, time, and notes.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog to create a new medication for a resident with dosage, route, schedule, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Large multi-section dialog to add a new resident with demographics, contacts, physicians, insurance, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog form for recording a resident’s weight entry with date, unit, and optional notes.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo with size and mode options, falling back to text if the image fails to load.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component that loads medication data into a form and submits updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog that populates and updates detailed resident records including physicians, pharmacy, insurance, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form that saves user name, role, and employee ID using useSaveCallerUserProfile.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty component file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen displaying diagnostics, logout, and retry options when startup issues occur.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, residents, and related backend data using a resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a backend actor with timeouts, identity handling, and optional admin token setup using React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, dialog overrides, and print-specific formatting.",
  "frontend/src/lib/actorInit.ts": "Utility functions for adding timeouts, normalizing backend errors, and detecting non-fatal initialization errors.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe asset URLs by normalizing Vite's BASE_URL and cleaning slashes.",
  "frontend/src/lib/dateUtils.ts": "Contains helpers for converting nanoseconds to dates, formatting dates, and calculating age without timezone issues.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main resident dashboard with sorting, filtering, status updates, and resident management UI interactions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication and branded UI components.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays a resident’s full profile with data fetching, editing dialogs, medical records, and printing options.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, shadows, and plugins for the frontend.",
  "project_state.json": "Snapshot describing project architecture, features, known issues, and versioned components."
}