{
  "backend/main.mo": "Defines the backend actor with authorization and storage mixins plus comprehensive resident, medication, physician, and related data types along with comparator utilities.",
  "feature_evidence.json": "Empty feature evidence report structure containing no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files describing major behaviors, UI patterns, and startup logic.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment checklist for Version 89 detailing pre-deploy verification, deployment steps, smoke tests, and constraints for a publish-only release.",
  "frontend/index.css": "Defines global Tailwind base styles, OKLCH color variables for light and dark themes, and shared border and body styling.",
  "frontend/index.html": "HTML entry point that sets up the root div and loads the frontend's main TypeScript module.",
  "frontend/src/App.tsx": "Main application logic handling authentication, actor initialization, startup health checks, routing, and fail-fast timeouts.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for adding ADL records with required fields, validations, and submission logic using solid white UI styling.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component for submitting daily vital signs, validating inputs, converting units, and sending data via useAddDailyVitals.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for adding a medication administration record, selecting active medications, validating fields, and submitting via useAddMarRecord.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog to add a new medication for a resident, mapping administration times and physician info before submitting via useAddMedication.",
  "frontend/src/components/AddResidentDialog.tsx": "Large form dialog to create a new resident with personal info, contacts, physicians, pharmacy, insurance, and medications using useAddResident.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for recording a resident's weight entry, converting date to nanoseconds and submitting via useAddWeightEntry.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo with size and mode options, falling back to text if the image fails to load.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component that preloads medication data, lets users edit fields, and submits updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog for editing all resident details including basic info, physicians, pharmacy, insurance, and medications, then saving via useUpdateResident.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form capturing name, role, and employee ID, then saving via useSaveCallerUserProfileStartup.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty file with no implemented content.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error and diagnostics screen displaying failure details, backend info, and actions for retrying or logging out.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and state management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles using both standard and resilient backend actors with timeout and error handling.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a backend actor with timeouts and optional admin initialization, exposing a resilient actor via a React Query hook.",
  "frontend/src/index.css": "Tailwind-based global styles, theme variables, dialog overrides, and print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for wrapping promises with timeouts and normalizing backend-related errors.",
  "frontend/src/lib/assetUrl.ts": "Builds safe asset URLs using Vite’s base path, avoiding double slashes and path issues.",
  "frontend/src/lib/dateUtils.ts": "Utility functions for converting dates to and from nanoseconds and formatting dates without timezone issues.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend diagnostics and performs a timeout-protected health check against the backend canister.",
  "frontend/src/lib/startupTimings.ts": "Centralized configuration for startup-related timeout values used across the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main resident management dashboard with filtering, sorting, and admin actions for resident records.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen and triggers Internet Identity authentication.",
  "frontend/src/pages/ResidentProfile.tsx": "Shows detailed resident information with tabs, editing dialogs, and medication/vitals management.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, plugins, and container settings.",
  "project_state.json": "Describes current project state and backend issues regarding user profile handling for unregistered users."
}