{
  "backend/main.mo": "Defines the main actor with authorization and storage mixins plus comprehensive resident‑related types and comparison utilities.",
  "backend/migration.mo": "Implements migration module containing legacy-compatible types and a no-op run function that returns existing state unchanged.",
  "feature_evidence.json": "Feature evidence report linking a dashboard UX feature to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files including routing, dialogs, hooks, and styling.",
  "frontend/index.css": "Tailwind base theme definitions providing OKLCH color variables, light/dark themes, and global element styling.",
  "frontend/index.html": "Base HTML document bootstrapping the React application through the root div and main.tsx entry script.",
  "frontend/src/App.tsx": "Main application router and authentication flow handling identity, resilient actor loading, profile setup, and route rendering.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for creating ADL records with required fields, validation, date conversion, and submission via React Query.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component that collects vital sign inputs, validates required fields, converts values, and submits a new daily vitals record for a resident.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Form dialog for selecting an active medication and submitting a new MAR record with administration details.",
  "frontend/src/components/AddMedicationDialog.tsx": "UI dialog that captures medication details, parses administration times, resolves prescribing physician, and submits a new medication for a resident.",
  "frontend/src/components/AddResidentDialog.tsx": "Large multi-section form for entering full resident information, including physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for recording a resident’s weight measurement, converting date input, validating fields, and submitting a weight entry.",
  "frontend/src/components/BrandLogo.tsx": "Component that displays the brand logo with size and mode options, falling back to text if the image fails to load.",
  "frontend/src/components/EditMedicationDialog.tsx": "Modal form for editing a resident’s medication and submitting updates via mutateAsync.",
  "frontend/src/components/EditResidentDialog.tsx": "Large modal form for editing all resident details including physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form that saves the caller’s name, role, and employee ID.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays startup errors with diagnostics and provides retry and logout actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and persistent identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and resident data using a backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a backend actor with timeout, optional admin setup, and React Query caching for resilient access.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color variables, dialog overrides, and print-specific formatting.",
  "frontend/src/lib/actorInit.ts": "Contains utilities for promise timeouts, error normalization, and detecting non-fatal initialization errors.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs that respect Vite's base path in development and production.",
  "frontend/src/lib/dateUtils.ts": "Provides functions for converting dates to and from nanoseconds, formatting dates, and calculating ages without timezone issues.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI for viewing, filtering, sorting, and managing residents with various React Query hooks.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication and branding UI elements.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays a resident’s full profile with data fetching, editing dialogs, medication updates, and error handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-stored parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, shadows, typography, container settings, and plugin extensions.",
  "project_state.json": "Describes the project’s current state, architecture, features, and known issues for the assisted living management system."
}