{
  "backend/main.mo": "Defines resident-related types and comparison utilities, includes authorization and storage mixins, and exposes no new backend logic.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to involved files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains short summaries of numerous frontend source files describing their roles and behaviors.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Provides the main production deployment checklist covering manual, scripted, and clean-rebuild deployment workflows.",
  "frontend/deployment_logs/.gitkeep": "Placeholder file describing the purpose of the deployment logs directory and the types of log and metadata files generated by deployment scripts.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment guide specific to Version 89 with publish-only steps and smoke-test summary.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme design tokens and applying base styles.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main TypeScript frontend module.",
  "frontend/scripts/clean_redeploy_production.sh": "Script performing a clean rebuild by removing caches and prior builds, injecting metadata, and redeploying to the IC with detailed logging.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for retrying version 89 publish-only deployments, building and deploying the frontend and saving canister IDs.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive script guiding operators through smoke tests and validating deployment artifacts and canister IDs.",
  "frontend/scripts/redeploy_production.sh": "Script rebuilding the frontend with injected metadata, deploying to the IC, and recording canister IDs and repo state.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed smoke-test checklist for validating Version 89 behavior after deployment.",
  "frontend/src/App.tsx": "Defines the root React app with authentication, backend actor initialization, startup health checks, and routing logic. Manages slow-start detection, failure modes, and conditional rendering for login, dashboard, and profile setup.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Provides a dialog form for adding ADL records for a resident, handling validation, state management, and mutation submission. Includes activity, assistance level, date, and notes fields.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Implements a dialog to record daily vitals for a resident, converting date/time to nanoseconds and submitting vitals via mutation. Handles temperature unit conversion, validation, and form state reset.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Creates a form dialog for logging medication administration records, selecting active medications and submitting administration details. Validates selections, converts date/time, and posts data via mutation.",
  "frontend/src/components/AddMedicationDialog.tsx": "Provides a dialog for adding a new medication to a resident, collecting dosage, route, times, physician, and notes. Parses administration times, links prescribing physicians, and submits via mutation.",
  "frontend/src/components/AddResidentDialog.tsx": "Dialog component for creating a new resident with fields for personal info, physicians, pharmacy, insurance, and responsible persons.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Form dialog to record a resident's weight entry including date, value, unit, and notes.",
  "frontend/src/components/BrandLogo.tsx": "Renders the application's logo with size and mode options, including a fallback if the image fails to load.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Displays frontend build metadata, environment, and backend canister ID with warnings for missing info.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing an existing medication's details such as dosage, route, administration times, and prescribing physician.",
  "frontend/src/components/EditResidentDialog.tsx": "Dialog for updating a resident’s profile including personal info, physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for entering and saving a user's name and employee ID using a startup-safe profile save mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty file with no implemented content.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a detailed startup error screen with diagnostics, error details, and retry/logout controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines profile and data-related queries and mutations using actors, including startup-safe variants with timeouts and error normalization.",
  "frontend/src/hooks/useResilientActor.ts": "Builds a resilient backend actor with timeouts and optional admin initialization, exposing status and retry controls.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme color variables, dialog overrides, and detailed print styles.",
  "frontend/src/lib/actorInit.ts": "Provides timeout handling, canister error detection, and normalization utilities for backend connection errors.",
  "frontend/src/lib/assetUrl.ts": "Builds safe asset URLs using Vite’s BASE_URL, normalizing slashes and paths.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata and environment info and generates build identifiers with fallbacks.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to and from nanoseconds and formats or derives age without timezone issues.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps string values to backend RoomType and ResidentStatus enums and vice versa.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend diagnostic info and performs a timeout-protected health check using an anonymous actor.",
  "frontend/src/lib/startupTimings.ts": "Defines standardized timeout constants for startup, health checks, and resident operations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing residents, sorting/filtering, and actions like discharge, archive, and delete using multiple query hooks.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that authenticates users via Internet Identity with a branded UI card.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page that fetches detailed data, manages dialogs for editing and adding records, and handles medication and vitals updates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters with hash‑routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, keyframes, and container settings for the frontend theme.",
  "project_state.json": "Metadata describing project state, existing features, and rollback requirements for Version 85 deployment."
}