{
  "backend/main.mo": "Defines backend actor with resident, physician, pharmacy, insurance, and medication data types plus comparison utilities, integrating authorization and blob‑storage mixins.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Provides high‑level summaries of major frontend files and components for reference.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment and smoke‑test checklist for Version 89 with no code changes allowed.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables and global light/dark styles.",
  "frontend/index.html": "HTML entry point loading the root div and main React script.",
  "frontend/src/App.tsx": "Main app flow handling identity, resilient actor initialization, startup timeout, health checks, routing, and user profile gating.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component that submits a new ADL record with date, activity, assistance level, and notes for a resident.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog for entering daily vital signs including temperature, blood pressure, pulse, respiration, oxygen saturation, glucose, and timestamp.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog to record medication administration details such as medication, time, administrator, and notes for a resident.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog used to add a medication to a resident, including dosage, route, administration times, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Large form dialog for creating a resident profile with personal info, physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog component for adding a resident's weight entry with form fields, validation, and mutation submission.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with size and mode options and provides a fallback text logo on load error.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing a resident's medication, populating initial values and submitting updates via mutation.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog for editing all resident details including personal info, physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form allowing a new user to enter name, role, and employee ID and save via mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty component file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Full‑screen error UI showing error details, diagnostics, and retry/logout actions during app startup failures.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor based on authentication state and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Includes utilities for creating AuthClient instances with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles and related backend data using actor instances, with error handling and startup-safe variants.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a resilient backend actor using identity when available, with timeouts, optional admin initialization, and standardized error handling via React Query.",
  "frontend/src/index.css": "Global Tailwind CSS setup with light/dark theme variables, dialog overrides, and extensive print styles for consistent printed output.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for actor initialization including timeouts, error normalization, and detection of non-fatal or stopped canister errors.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe URLs for static assets, normalizing slashes and supporting deployment under custom base paths.",
  "frontend/src/lib/dateUtils.ts": "Contains date conversion and formatting helpers for converting between nanoseconds and readable strings while avoiding timezone issues.",
  "frontend/src/lib/startupDiagnostics.ts": "Provides utilities to detect backend canister connection info and perform a timeout-protected health check.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Displays resident lists with filtering, sorting, and admin actions such as discharging or archiving residents.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication and branding.",
  "frontend/src/pages/ResidentProfile.tsx": "Shows detailed resident information with tabs and dialogs for editing, medication, vitals, and records.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and theme settings for the app.",
  "project_state.json": "Describes project state for fixing IC backend canister issues, including stopped-canister errors, startup flow bugs, and a new healthCheck feature request."
}