{
  "backend/main.mo": "Defines the actor with authorization and storage mixins plus extensive resident-related types and comparator functions for sorting residents, physicians, and medications.",
  "feature_evidence.json": "Lists feature evidence entries mapping implemented features to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files describing their responsibilities and UI behaviors.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH color variables, dark mode values, and base styling for consistent theming.",
  "frontend/index.html": "Basic HTML entry point that mounts the React application and loads the main frontend script.",
  "frontend/src/App.tsx": "Main application router and authentication gate handling identity, actor initialization, profile checks, error states, and page routing.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for adding ADL records with activity selection, assistance levels, date input, validation, and submission to the backend.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component for entering and submitting daily vital signs for a resident, including validation and unit conversion.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for recording medication administration events, selecting active medications, and submitting MAR records.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog to add a new medication for a resident, including dosage, route, schedule, and physician lookup.",
  "frontend/src/components/AddResidentDialog.tsx": "Large dialog for creating a new resident with personal info, contacts, insurance, physicians, and initial medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a resident weight entry with date, units, validation, and form submission.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that loads an image with size modes and shows a text fallback if loading fails.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component for editing a resident's medication, managing form state and submitting updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog for editing a resident's full profile, populating fields from existing data and submitting updates via useUpdateResident.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form allowing a user to enter name, role, and employee ID and save via useSaveCallerUserProfile.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty component file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen showing startup failures with diagnostics and options to retry or log out.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, logout, stored identity loading, and exposing identity status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, residents, and related backend data through a resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and manages a backend actor with timeout handling, identity integration, and optional admin initialization.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dialog overrides, and print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for promise timeouts, error normalization, and identifying non-fatal initialization errors.",
  "frontend/src/lib/assetUrl.ts": "Generates clean, base-path-safe URLs for static assets based on Vite’s configured base URL.",
  "frontend/src/lib/dateUtils.ts": "Implements date conversion utilities between strings and nanoseconds plus formatting and age calculation helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the resident dashboard with sorting, filtering, status updates, and resident management actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication, branding, and a styled card layout.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays and manages a resident’s detailed profile with data fetching, editing dialogs, medication updates, and clinical records.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, shadows, and plugins for the frontend UI.",
  "project_state.json": "Describes the project’s architecture, features, known issues, and versioned components for the assisted living management system."
}