{
  "backend/main.mo": "Motoko backend actor defining resident-related data types and comparators, including authorization and blob storage mixins.",
  "feature_evidence.json": "JSON report listing implemented features, affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Aggregated descriptions of major frontend components, hooks, pages, dialogs, and utilities.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Primary production deployment checklist explaining manual, scripted, and clean redeploy procedures with backend canister start instructions.",
  "frontend/deployment_logs/.gitkeep": "Describes the purpose of the deployment logs directory and the types of log and metadata files stored there.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical Version 89 deployment-only checklist with build, deploy, retry script usage, and smoke tests.",
  "frontend/index.css": "Defines Tailwind CSS layers and custom CSS variables for light and dark themes used across the frontend.",
  "frontend/index.html": "Basic HTML entry point that loads the frontend application via main.tsx into the root div.",
  "frontend/public/build-meta.json": "Placeholder build metadata file overwritten during deployment with version, commit, and timestamp info.",
  "frontend/scripts/clean_redeploy_production.sh": "Script that performs a clean rebuild by removing caches and dist output, injects build metadata, and redeploys the frontend to production.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for rebuilding and redeploying Version 89 only, including logging and canister ID extraction.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive script that guides operators through smoke tests and verifies deployment artifacts such as logs and canister IDs.",
  "frontend/scripts/redeploy_production.sh": "Builds the frontend with metadata, deploys it to the IC network, logs output, and records canister IDs.",
  "frontend/scripts/restart_backend_canister.sh": "Checks backend canister status and starts or restarts it on the IC network.",
  "frontend/SMOKE_TEST_VERSION_89.md": "A detailed post-deployment smoke test checklist for verifying Version 89 functionality in production, covering login, authentication, and dashboard loading.",
  "frontend/src/App.tsx": "Main app root handling authentication, backend actor initialization, health checks, and routing.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for creating ADL records for a resident and submitting them via a mutation hook.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog form for recording daily vitals, converting units and timestamps before submitting via API.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for creating medication administration records, selecting active medications and submitting them.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog form for adding a medication to a resident, handling form state, validation, physician matching, and mutation submission.",
  "frontend/src/components/AddResidentDialog.tsx": "Large admin-gated dialog to create a new resident with multi-section inputs including physicians, pharmacy, insurance, and responsible persons.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for recording a resident's weight entry with date, unit selection, notes, and submission via mutation.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that loads an image with size/mode options and falls back to text on load failure.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "UI indicator showing frontend build info and backend canister ID with fallback handling and warnings for missing metadata.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing existing medication details with pre-filled fields, validation, and update mutation execution.",
  "frontend/src/components/EditResidentDialog.tsx": "Large admin-only dialog component for editing resident details with prefilled fields, enum mappings, and update mutation handling.",
  "frontend/src/components/ProfileSetup.tsx": "User profile setup form collecting name and employee ID with a startup-safe save mutation and basic validation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a detailed startup error screen with diagnostics, stopped‑canister guidance, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles and resident data with timeouts and error normalization.",
  "frontend/src/hooks/useResilientActor.ts": "React hook that creates a backend actor with timeouts, optional admin initialization, and exposes query state.",
  "frontend/src/index.css": "Tailwind-based global styles defining themes, dialog overrides, and print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Utilities for wrapping promises with timeouts and detecting specific backend, network, and timeout errors.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite’s base path and cleans duplicate slashes.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata from environment or fallback file and constructs version identifiers.",
  "frontend/src/lib/dateUtils.ts": "Date helpers converting between strings and nanoseconds, formatting dates, and computing ages without timezone issues.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps frontend string values to backend RoomType and ResidentStatus enums and vice versa.",
  "frontend/src/lib/startupDiagnostics.ts": "Provides utilities to derive backend diagnostics from config and perform a timed health check.",
  "frontend/src/lib/startupTimings.ts": "Defines central timeout constants for various startup operations.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Dashboard.tsx": "Displays active and discharged residents with admin actions, error handling, and dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen using Internet Identity with branding and loading states.",
  "frontend/src/pages/ResidentProfile.tsx": "Shows detailed resident information with admin-gated editing and multiple record dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, shadows, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, features, and runbook requirements related to backend canister uptime and restart operations."
}