{
  "backend/main.mo": "Defines the backend actor with authorization and storage mixins plus comprehensive resident, medication, physician, and related data types and comparison utilities.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI styling requirements to affected files and components with associated metadata and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries describing the purpose and behavior of various frontend files including components, hooks, and pages.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes, applying global background and border defaults.",
  "frontend/index.html": "Minimal HTML document setting up the root element and loading the frontend entry script.",
  "frontend/src/App.tsx": "Implements the application root with authentication, resilient backend actor initialization, profile gating, and TanStack Router route setup.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for adding ADL records with controlled form fields, solid white UI styling, and mutation submission to the backend.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog form for entering and submitting daily vital signs for a resident, including date, time, vitals, and notes.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog to record medication administration for a resident, selecting an active medication and submitting administration details.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog for adding a new medication to a resident, capturing dosage, route, schedule, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Large dialog for creating a new resident with full demographic, medical, physician, pharmacy, insurance, contacts, and medication details.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a weight measurement for a resident, including date, value, unit, and notes.",
  "frontend/src/components/BrandLogo.tsx": "Component rendering the brand logo with configurable size and fallback text if the image fails to load.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component for editing a resident’s medication, managing form state and submitting updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog for editing a resident’s full profile, including personal info, physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form that saves the caller’s name, role, and employee ID using useSaveCallerUserProfile.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen UI showing startup failures, diagnostics, retry and logout actions, using Internet Identity state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity context and provider managing login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, residents, and related backend data through a resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a backend actor with timeouts and optional admin setup, exposing its state via a React Query hook.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dialog overrides, and print-specific CSS rules.",
  "frontend/src/lib/actorInit.ts": "Utility helpers for actor initialization including timeout wrapping, error normalization, and non-fatal error detection.",
  "frontend/src/lib/assetUrl.ts": "Generates safe asset URLs using Vite’s base path, normalizing slashes and handling edge cases.",
  "frontend/src/lib/dateUtils.ts": "Date utilities for converting dates to and from backend nanoseconds and formatting or calculating age without timezone issues.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing resident lists with filtering, sorting, and actions, integrating various React Query hooks and UI components.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication and a styled card UI.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays a detailed resident profile with data fetching, editing dialogs, medication and vitals management, and extensive UI controls.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, plugins, and extended utilities for the frontend.",
  "project_state.json": "Defines the project’s current state, architecture notes, and known issues for the Moritz Care Home system."
}