{
  "backend/main.mo": "Defines resident management types and comparers, integrating authorization and blob storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Provides human-written summaries for many frontend files describing their roles and behaviors.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment and smoke‑test checklist for Version 89 with no code or feature changes allowed.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color systems and global styling.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main app logic handling authentication, startup timeouts, early health checks, routing, and error states.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Provides a dialog form for adding an ADL record, capturing date, activity, assistance level, and staff notes before submitting via useAddAdlRecord.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Defines a dialog to record daily vital signs, converting date/time to nanoseconds and submitting vitals through useAddDailyVitals.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Implements a dialog for logging medication administration, selecting active medications and submitting time, staff, and notes using useAddMarRecord.",
  "frontend/src/components/AddMedicationDialog.tsx": "Renders a form to add a new medication to a resident, including dosage, route, times, and physician lookup, submitted via useAddMedication.",
  "frontend/src/components/AddResidentDialog.tsx": "Contains a large multi-section form for creating a new resident record, collecting personal details, physicians, insurance, contacts, and medications before submitting with useAddResident.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Provides a dialog form to create a weight entry for a resident, validating inputs and submitting via a mutation hook.",
  "frontend/src/components/BrandLogo.tsx": "Renders the app logo with configurable size and mode, falling back to text if the image fails to load.",
  "frontend/src/components/EditMedicationDialog.tsx": "Displays a dialog for editing an existing medication, preloading fields and submitting changes through a mutation.",
  "frontend/src/components/EditResidentDialog.tsx": "Large dialog for editing resident information, prepopulating all fields and updating via a mutation hook.",
  "frontend/src/components/ProfileSetup.tsx": "Form for initial user profile setup, capturing name, role, and employee ID, then saving through a mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "File is empty or not yet implemented.",
  "frontend/src/components/StartupErrorScreen.tsx": "Fullscreen error screen showing error details, diagnostics, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status flags. Includes helper functions for creating AuthClient instances with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles and other backend data, including startup-safe variants using resilient actors and timeout handling. Handles error normalization and cache invalidation.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a resilient backend actor with timeout, identity support, and optional admin initialization. Exposes actor state via a React Query hook with controlled retry and fetch behavior.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables for light and dark themes, overrides for dialog components, and comprehensive print styles. Ensures consistent layout and appearance across themes and print outputs.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for wrapping promises with timeouts and normalizing backend errors, including detection of stopped canisters and non-fatal conditions. Used to improve reliability of actor initialization and requests.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe URLs for public assets by normalizing Vite's BASE_URL and preventing double slashes.",
  "frontend/src/lib/dateUtils.ts": "Implements date conversion utilities between YYYY-MM-DD strings and nanoseconds, plus formatting and age calculation without timezone offset issues.",
  "frontend/src/lib/startupDiagnostics.ts": "Provides backend diagnostics extraction from environment and performs a timeout‑protected health check call.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeout constants used during frontend startup operations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main resident dashboard with filtering, sorting, and resident management actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen using Internet Identity with a styled card and background.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays detailed resident information, medical records, and editing dialogs based on a route ID.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters via query strings or hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom color tokens, extended shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state and feature requests focused on improving startup fallback behavior when the backend is slow but reachable."
}