{
  "backend/main.mo": "Defines the backend actor with authorization and blob storage mixins, plus comprehensive resident-related types and comparison utilities for sorting.",
  "feature_evidence.json": "Reports feature evidence linking print stylesheet updates and print view audits to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files describing their roles, UI behaviors, and architectural patterns.",
  "frontend/index.css": "Tailwind base styles defining the global OKLCH color system, theme variables, and consistent light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main application router and authentication flow managing identity, backend actor initialization, profile setup, and route rendering.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for adding ADL records with form inputs, validation, and mutation logic using solid white UI styling.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component that captures and submits daily vital sign data for a resident, converting values and validating required fields before mutation.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for creating a medication administration record, validating inputs and submitting selected medication details for a resident.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog to add a new medication to a resident, handling dosage, route, physician matching, and administration times.",
  "frontend/src/components/AddResidentDialog.tsx": "Extensive form dialog for adding a new resident with personal info, physicians, pharmacy, insurance, responsible persons, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog to record a resident’s weight entry, converting date and submitting weight data with optional notes.",
  "frontend/src/components/BrandLogo.tsx": "Component that displays the brand logo with configurable sizing and fallback text rendering on load failure.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component that loads medication details into a form and submits edits using useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large form dialog that populates resident data and updates all resident fields via useUpdateResident.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form that saves a user's name, role, and employee ID via useSaveCallerUserProfile.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component file.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen UI showing diagnostic info with retry and logout actions using Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, persistence, and status management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and resident data via a resilient backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and manages a backend actor with timeout, optional admin initialization, and React Query state handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dialog overrides, and detailed print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Implements utilities for promise timeouts, error normalization, and non‑fatal error detection during actor initialization.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite’s BASE_URL while preventing double slashes.",
  "frontend/src/lib/dateUtils.ts": "Contains date conversion, formatting, and age‑calculation helpers using nanoseconds and UTC semantics.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI for listing, filtering, sorting, and managing residents.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding and an Internet Identity login button driven by useInternetIdentity.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays a resident’s full profile with data fetching, editing dialogs, medication and vitals management, and error handling tied to the residentId route param.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning values from URLs or hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, and animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Captures the project’s current architecture, features, known issues, and versioned component notes for the IC-based assisted living system."
}