{
  "backend/main.mo": "Defines the backend actor with authorization and blob storage mixins, plus data models and comparison helpers for residents, physicians, medications, and related entities.",
  "feature_evidence.json": "Feature evidence report describing a frontend registration bootstrap fix, listing affected files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for numerous frontend files covering components, pages, hooks, styling, and utility logic.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Primary production deployment checklist detailing verification steps, manual and scripted deployment options, logging, and rollback procedures.",
  "frontend/deployment_logs/.gitkeep": "Describes the purpose and structure of the deployment logs directory and the metadata generated by deployment scripts.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Historical deployment checklist for Version 89 outlining build, deploy, retry script usage, and smoke-test references.",
  "frontend/index.css": "Defines Tailwind layers and numerous CSS variables for light and dark themes, applying global border, background, and text styles.",
  "frontend/index.html": "Basic HTML shell that loads the frontend app via main.tsx into a root div.",
  "frontend/public/build-meta.json": "Placeholder JSON file for build metadata, overwritten during deployment.",
  "frontend/scripts/clean_redeploy_production.sh": "Script that cleans previous build artifacts, injects build metadata, rebuilds the frontend, and redeploys to the IC network with logging.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Historical script for retrying Version 89 publish‑only deployment, building the frontend and deploying to the IC network.",
  "frontend/scripts/post_deploy_smoke_test_helper.sh": "Interactive helper script guiding operators through smoke tests and verifying recent deployment artifacts.",
  "frontend/scripts/redeploy_production.sh": "Script that builds the frontend with injected metadata and redeploys it to the IC network while recording logs and canister IDs.",
  "frontend/scripts/restart_backend_canister.sh": "Utility script to start or restart the backend canister on the IC network and verify its final status.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed post-deployment smoke test instructions for Version 89 covering login, authentication, dashboard loading, and error checking.",
  "frontend/src/App.tsx": "Main app entry defining routes and handling authentication, actor initialization, and backend health checks with multiple loading and failure states.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Modal form for creating an ADL record, validating required inputs and submitting via mutation.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog for recording daily vital signs, converting date/time to nanoseconds and submitting through a mutation.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Form dialog to add a medication administration record for a resident, selecting active medications and saving via mutation.",
  "frontend/src/components/AddMedicationDialog.tsx": "Modal for adding a new medication to a resident, including route, dosage, administration times, and physician lookup.",
  "frontend/src/components/AddResidentDialog.tsx": "Dialog form to add a new resident with admin checks and multi-section data entry for physicians, pharmacy, insurance, and responsible persons.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for recording a resident’s weight entry, validating required fields and submitting via mutation.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that loads a branded image with size modes and a text fallback on load error.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Displays frontend build info, backend canister ID, and warnings when metadata or connections are missing.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing a resident’s medication with pre-filled fields and update mutation handling.",
  "frontend/src/components/EditResidentDialog.tsx": "Comprehensive editor for resident details with admin guard, pre-filled data, and full multi-section updates.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for entering and saving a user's name and employee ID using a profile mutation.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays detailed startup errors, including canister status, diagnostics, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user registration, profile loading, and various backend data operations with timeouts and error mapping.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a backend actor with timeouts and optional admin initialization, handling non-fatal errors and preventing auto-retries.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, forces opaque dialog styles, and includes print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Provides timeout wrapping and detailed error classification helpers for backend actor initialization.",
  "frontend/src/lib/assetUrl.ts": "Generates normalized asset URLs using Vite base paths to avoid double slashes and ensure correct deployment paths.",
  "frontend/src/lib/buildInfo.ts": "Retrieves build metadata from env vars or a fallback file and constructs version identifiers with environment detection.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to/from nanoseconds and provides formatting and age calculation without timezone issues.",
  "frontend/src/lib/registrationErrorMapping.ts": "Maps backend registration errors to user-friendly messages and detects anonymous or provisioning-specific errors.",
  "frontend/src/lib/residentEnumMapping.ts": "Maps frontend select values to backend enum types for room type and resident status with backward-compatible aliases.",
  "frontend/src/lib/startupDiagnostics.ts": "Provides backend diagnostics extraction from environment and performs a timeout‑protected health check call.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeout constants used during application startup.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the resident dashboard with active/discharged lists, admin actions, and retry/error handling.",
  "frontend/src/pages/LoginPage.tsx": "Displays the Internet Identity login screen with branding and login state handling.",
  "frontend/src/pages/ResidentProfile.tsx": "Shows a detailed resident profile with admin‑gated editing, tabs, and retryable data loading.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended shadows, animations, and typography/container-query plugins.",
  "project_state.json": "Project metadata describing registration issues, architectural notes, and pending feature requests to fix baseline user registration and improve backend error signaling."
}