{
  "backend/main.mo": "Defines core resident-related types and comparison utilities, and incorporates authorization and blob‑storage mixins into the main actor.",
  "feature_evidence.json": "Feature evidence report mapping two resilience-related frontend features to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Flat JSON-style list summarizing the purpose and behavior of key frontend files including pages, components, hooks, and utilities.",
  "frontend/deployment_logs/.gitkeep": "Placeholder file ensuring the deployment_logs directory is committed.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment checklist for Version 89 with manual and scripted deployment steps plus quick smoke-test requirements.",
  "frontend/index.css": "Tailwind base and theme definitions using OKLCH variables with light/dark mode values and global element styling.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads main.tsx.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Bash script that rebuilds and redeploys version 89 to the IC network, logging all output and saving canister IDs for diagnostics.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Comprehensive Version 89 smoke-test guide detailing prerequisites, test steps, and expected results for core user flows.",
  "frontend/src/App.tsx": "Main React app entry handling identity, resilient actor initialization, startup health checks, routing, and error fallbacks.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for adding an ADL record to a resident, validating inputs and submitting via a mutation hook.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog form for recording a resident’s daily vital signs, converting units and timestamps before submitting.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for adding a medication administration record, selecting active meds and submitting with timestamp and notes.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog for adding a new medication to a resident, collecting dosage, route, schedule, and physician info before saving.",
  "frontend/src/components/AddResidentDialog.tsx": "No summary available.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "No summary available.",
  "frontend/src/components/BrandLogo.tsx": "No summary available.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "No summary available.",
  "frontend/src/components/EditMedicationDialog.tsx": "No summary available.",
  "frontend/src/components/EditResidentDialog.tsx": "No summary available.",
  "frontend/src/components/ProfileSetup.tsx": "No summary available.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "No summary available.",
  "frontend/src/components/StartupErrorScreen.tsx": "UI component that displays startup errors with diagnostics, authentication status, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching hooks for profiles and related entities using actors, with timeout handling and resilient variants for startup.",
  "frontend/src/hooks/useResilientActor.ts": "Hook that creates a backend actor with timeout and best‑effort admin initialization, avoiding retries and providing error state.",
  "frontend/src/index.css": "Global Tailwind CSS configuration including color variables, dark mode, dialog overrides, and detailed print styles.",
  "frontend/src/lib/actorInit.ts": "Provides timeout wrapping, error normalization, and utilities for detecting and classifying backend canister errors.",
  "frontend/src/lib/assetUrl.ts": "Builds safe asset URLs using Vite's base path while preventing double slashes.",
  "frontend/src/lib/buildInfo.ts": "Generates frontend build metadata including version, timestamp, commit, and environment.",
  "frontend/src/lib/dateUtils.ts": "Converts between date strings and nanoseconds and formats dates without timezone issues.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend connection info and performs a timeout‑safe health check on the backend canister.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeout values for startup, health checks, and resident data loading.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the resident management dashboard with filtering, sorting, admin actions, and data queries.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login screen with branding and loading feedback.",
  "frontend/src/pages/ResidentProfile.tsx": "React page displaying a resident profile, loading resident data, handling dialogs for editing info and adding records, and managing medication and vitals interactions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based query support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, shadows, keyframes, and plugin usage for the frontend.",
  "project_state.json": "Project state file tracking features, issues, and pending requests related to backend connectivity and startup health checks."
}