{
  "backend/main.mo": "Motoko actor defining resident management types and comparison helpers, mixing in authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report listing dashboard-related authorization, error handling, and UI behavior changes with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend source files to concise summaries describing their purpose and key behaviors.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Publish-only deployment checklist for Version 89 including pre‑deployment checks, steps, smoke tests, and constraints.",
  "frontend/index.css": "Tailwind base/theme variable definitions and global styles for light/dark modes.",
  "frontend/index.html": "HTML entry point loading the root element and main React script.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, profile loading, routing, and global UI providers.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Provides a dialog form for adding an ADL record, capturing date, activity, assistance level, and notes, then submitting via a mutation hook.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Implements a dialog for recording daily vital signs including temperature, blood pressure, pulse, respiratory rate, oxygen saturation, and optional glucose.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Renders a dialog to log medication administration by selecting an active medication and entering time, administrator, and notes.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog form for adding a medication to a resident, collecting dosage, route, administration times, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Defines a large multi-section dialog for creating a new resident with personal info, physicians, pharmacy, insurance, responsible persons, and initial medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Provides a dialog form to create a weight entry for a resident and submit it via a mutation.",
  "frontend/src/components/BrandLogo.tsx": "Displays the Moritz Care Home logo with sizing modes and a text fallback on load failure.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog for editing an existing medication, preloading fields and submitting updated data.",
  "frontend/src/components/EditResidentDialog.tsx": "Large editable form for updating a resident’s core info, contacts, insurance, and medications.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form for users to enter and save their name, role, and employee ID on first setup.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen showing diagnostics and offering retry and logout actions on startup failure.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status flags. Handles AuthClient creation, stored identity loading, and login flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, authorization status, and resident-related data through a resilient backend actor. Each hook waits for the actor and triggers backend calls with proper caching keys.",
  "frontend/src/hooks/useResilientActor.ts": "Creates a backend actor tied to the current identity with timeout protection and optional admin initialization. Exposes the actor plus loading and error state via React Query.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables for light and dark modes, dialog overrides, and detailed print-specific styling. Ensures consistent theming, layout, and color behavior across UI and print views.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for wrapping async operations with timeouts and normalizing backend errors, plus helpers to classify non‑fatal and authorization errors.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite’s base path, removing duplicate slashes and ensuring consistent path formatting.",
  "frontend/src/lib/dateUtils.ts": "Implements date conversion utilities between nanoseconds and human-readable formats, preserving calendar dates without timezone drift and providing age calculation.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting App inside React Query and Internet Identity providers with global styling.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page fetching and displaying resident lists with filtering, sorting, and admin actions like discharge and archive.",
  "frontend/src/pages/LoginPage.tsx": "Login screen providing Internet Identity authentication with a styled UI card.",
  "frontend/src/pages/ResidentProfile.tsx": "Resident profile page showing detailed resident data, tabs for records, and dialogs for editing, medications, vitals, and logs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, spacing, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing system architecture, features, issues, and versioned component notes."
}