{
  "backend/main.mo": "Defines the main actor with resident-related types and comparison helpers, integrating authorization and blob storage mixins.",
  "backend/migration.mo": "Implements a migration that auto-archives discharged residents older than 30 days while preserving all other data.",
  "feature_evidence.json": "Contains feature evidence records linking dashboard discharge/delete actions and admin checks to specific frontend files.",
  "frontend-file-summaries.txt": "Lists short descriptions of key frontend files, including pages, dialogs, hooks, and utilities.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment and smoke‑test checklist for Version 89 with no code changes allowed.",
  "frontend/index.css": "Defines global Tailwind-based theme variables and styles for light/dark modes and layout behavior.",
  "frontend/index.html": "Provides the base HTML shell loading the React application entry point.",
  "frontend/src/App.tsx": "Main app initializes identity, actors, user profile, and startup diagnostics with health checks and timeout logic, then routes to login or authenticated pages.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for submitting a resident's ADL record with date, activity, assistance level, and notes via a mutation hook.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog for entering daily vital signs for a resident, converting date/time to nanoseconds and submitting via a mutation hook.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for recording medication administration for a resident, selecting an active medication and submitting time and notes.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog for adding a new medication to a resident's profile, including dosage, route, schedule, physician, and notes.",
  "frontend/src/components/AddResidentDialog.tsx": "Complex form dialog for adding a resident with fields for personal info, contacts, medications, and related entities, submitting via useAddResident.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a weight measurement to a resident, validating inputs and submitting via useAddWeightEntry.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with configurable size and fallback text if loading fails.",
  "frontend/src/components/EditMedicationDialog.tsx": "Form dialog for editing an existing medication, preloading values and submitting updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Dialog for editing resident details, prepopulating all fields and submitting updates via useUpdateResident.",
  "frontend/src/components/ProfileSetup.tsx": "Initial user profile setup form capturing name, role, and employee ID, saved via useSaveCallerUserProfileStartup.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty or placeholder component file with no implemented content.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen component displaying error details, diagnostics, and retry/logout controls during startup failures.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles with both standard and startup-safe actor handling.",
  "frontend/src/hooks/useResilientActor.ts": "Builds a timeout-protected, fault-tolerant backend actor with optional admin initialization, exposing its state via React Query.",
  "frontend/src/index.css": "Global Tailwind CSS styles, theme variables, dialog overrides, and print-specific layout rules.",
  "frontend/src/lib/actorInit.ts": "Provides utilities for promise timeouts, error pattern detection, and converting backend errors into normalized user-friendly messages.",
  "frontend/src/lib/assetUrl.ts": "Generates base-path-safe URLs for static assets, normalizing slashes and Vite base URL handling.",
  "frontend/src/lib/dateUtils.ts": "Converts dates to and from nanoseconds, formats dates, and calculates age while avoiding timezone offsets.",
  "frontend/src/lib/startupDiagnostics.ts": "Collects backend diagnostic info and performs a public health check to verify backend reachability during startup.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeout constants used during application startup flows.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider before rendering the root component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main resident management dashboard with filtering, sorting, admin actions, and resident lifecycle operations.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with Internet Identity authentication and branding UI.",
  "frontend/src/pages/ResidentProfile.tsx": "React page that loads resident data, manages multiple dialogs, and displays profile details with actions for medications, vitals, MAR/ADL records, and printing.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL parameters with sessionStorage persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending color tokens, container settings, animations, shadows, and theme utilities.",
  "project_state.json": "Project state file describing dashboard features, known issues, and pending requests for resident discharge and delete actions."
}