{
  "backend/main.mo": "Defines core resident-related types and comparison utilities with authorization and storage mixins included in the backend actor.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing their purpose and functionality.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment checklist for Version 89 covering build steps, retry script usage, and smoke-test prerequisites.",
  "frontend/index.css": "Defines global Tailwind-based styling including color variables, dark mode values, and base theme rules.",
  "frontend/index.html": "Minimal HTML entry point that loads the React application root and main script.",
  "frontend/scripts/deploy_version_89_publish_only_retry.sh": "Retry script that rebuilds the frontend, deploys to the IC network, logs all output, and saves canister IDs.",
  "frontend/SMOKE_TEST_VERSION_89.md": "Detailed Version 89 smoke‑test procedures verifying login, authentication, dashboard loading, and error‑free behavior.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, startup health checks, and routing.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog form for adding ADL records for a resident, including date, activity, assistance level, and notes.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog form to record a resident's daily vital signs with validation and backend submission.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for adding a medication administration record tied to a resident’s active medications.",
  "frontend/src/components/AddMedicationDialog.tsx": "Dialog form for adding a new medication to a resident, including dosage, route, times, and physician info.",
  "frontend/src/components/AddResidentDialog.tsx": "Form dialog for creating a resident record, supporting multiple physicians, responsible persons, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a weight measurement to a resident, validating inputs and submitting via mutation.",
  "frontend/src/components/BrandLogo.tsx": "Displays the application logo with size and mode options, falling back to text if the image fails to load.",
  "frontend/src/components/DiagnosticsIndicator.tsx": "Shows build info and backend canister ID with tooltip details for diagnostics.",
  "frontend/src/components/EditMedicationDialog.tsx": "Form dialog for editing a resident’s medication, preloading existing values and submitting updates.",
  "frontend/src/components/EditResidentDialog.tsx": "Large dialog for editing full resident details, populating fields from the selected resident and submitting updates.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form allowing a user to save their name and employee ID.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/StartupErrorScreen.tsx": "React component that displays a startup error screen with error details, backend diagnostics, and retry/logout actions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles and other backend data, including startup‑safe versions.",
  "frontend/src/hooks/useResilientActor.ts": "Hook that creates a backend actor with timeouts and best‑effort admin initialization, providing safer startup behavior.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode, dialog overrides, and extensive print‑specific styling.",
  "frontend/src/lib/actorInit.ts": "Promise timeout wrapper plus helpers for detecting, normalizing, and classifying backend canister errors.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-safe asset URLs using Vite’s BASE_URL and normalizes slashes.",
  "frontend/src/lib/buildInfo.ts": "Generates frontend build/version info and a compact build identifier based on env vars and commit hash.",
  "frontend/src/lib/dateUtils.ts": "Converts between date strings and nanoseconds and formats or computes ages without timezone issues.",
  "frontend/src/lib/startupDiagnostics.ts": "Extracts backend diagnostics from environment and performs a timeout-protected health check.",
  "frontend/src/lib/startupTimings.ts": "Defines centralized timeouts for startup, health checks, and actor/profile operations.",
  "frontend/src/main.tsx": "Frontend entry point initializing React, query client, Internet Identity provider, and rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Resident dashboard that fetches, sorts, filters, and manages residents with admin actions and UI dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with a styled card and background image.",
  "frontend/src/pages/ResidentProfile.tsx": "React page that loads a resident by ID, displays detailed profile info, and manages dialogs for editing, MAR/ADL records, medications, vitals, and printing states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, shadows, typography, container settings, and plugins.",
  "project_state.json": "Project state file describing fix requirements, known issues, and existing feature definitions for resolving missing admin actions in production."
}