{
  "backend/main.mo": "Defines resident care data types and comparison utilities, and initializes authorization and storage mixins in the main actor.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files for reference or tooling.",
  "frontend/DEPLOYMENT_VERSION_89.md": "Deployment and smoke‑test checklist for Version 89, emphasizing no‑change publish‑only deployment requirements.",
  "frontend/index.css": "Tailwind base setup defining OKLCH design tokens for light and dark themes and global background/foreground styling.",
  "frontend/index.html": "Basic HTML shell loading the React application root and main entry script.",
  "frontend/src/App.tsx": "Main application logic handling authentication, actor initialization, profile setup, and TanStack Router configuration.",
  "frontend/src/components/AddAdlRecordDialog.tsx": "Dialog component for creating ADL records with form fields, validation, and mutation submission.",
  "frontend/src/components/AddDailyVitalsDialog.tsx": "Dialog component for entering and submitting daily vital signs for a resident using a mutation hook.",
  "frontend/src/components/AddMarRecordDialog.tsx": "Dialog for adding a medication administration record, selecting active medications and submitting administration details.",
  "frontend/src/components/AddMedicationDialog.tsx": "Form dialog to create a new medication for a resident, including dosage, route, times, and prescribing physician.",
  "frontend/src/components/AddResidentDialog.tsx": "Large dialog for creating a new resident with personal details, contacts, physicians, insurance, and medications.",
  "frontend/src/components/AddWeightEntryDialog.tsx": "Dialog for adding a resident’s weight measurement with unit selection and notes.",
  "frontend/src/components/BrandLogo.tsx": "Displays a brand logo image with size and mode options and a text fallback on load error.",
  "frontend/src/components/EditMedicationDialog.tsx": "Dialog component that loads medication data into a form, allows editing fields, and submits updates via useEditMedication.",
  "frontend/src/components/EditResidentDialog.tsx": "Large resident-editing form that populates from a Resident object and submits updates using useUpdateResident.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form collecting name, role, and employee ID and saving them via useSaveCallerUserProfile.",
  "frontend/src/components/ResidentPhotoUpload.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays startup errors with diagnostics, retry, and logout options, using Internet Identity and react-query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity persistence, and status handling via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, authorization status, and resident data from the backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and manages a resilient backend actor with timeout handling, optional admin initialization, and React Query integration.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dialog overrides, and print-specific styling for consistent UI rendering.",
  "frontend/src/lib/actorInit.ts": "Offers utilities for actor initialization including timeout wrapping, error normalization, and categorization of non-fatal and authorization errors.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite's base path while preventing double slashes.",
  "frontend/src/lib/dateUtils.ts": "Implements date conversion utilities between strings and nanoseconds, plus formatting and age calculation without timezone issues.",
  "frontend/src/main.tsx": "Initializes the React app, setting up QueryClient, Internet Identity provider, and global styles before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with resident lists, filters, sorting, admin actions, and dialogs using various backend query hooks.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with a branded card and a button that triggers Internet Identity authentication.",
  "frontend/src/pages/ResidentProfile.tsx": "Displays a resident’s detailed profile with data fetching, dialogs for editing and adding records, and validation of the resident ID.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL or hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, breakpoints, and animations for the app’s UI theme.",
  "project_state.json": "Contains the project’s state, architectural notes, and known issues for the Moritz Care Home system."
}