{
  "kind": "build_request",
  "title": "Apply fixed-width mobile/desktop print layout fix across all reports",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Update the global print stylesheet to force a consistent desktop-style print viewport on all devices (desktop, mobile, tablet) by locking the printed layout to a fixed width inside `@media print`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Apply the print fix to all reports"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/index.css` under `@media print`, `html` and `body` are forced to a fixed desktop-style width (e.g., 1000px) with centered margins so mobile/tablet printing no longer triggers narrow responsive layout.",
        "The fixed-width print override does not affect non-print (screen) rendering.",
        "Printing from a mobile browser produces the same multi-column report layout as desktop for the Resident Profile Report, MAR Report, and ADL Report."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Audit all report print render paths in the UI and ensure each report’s printable root container opts into the shared print styles so the fixed-width print override applies consistently (Resident Profile Report, MAR Report, ADL Report, and any other report print views already present).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Apply the print fix to all reports"
        ]
      },
      "acceptanceCriteria": [
        "Each existing report print view uses a common printable root class (existing `print-profile` or a new shared class) so the global `@media print` rules apply uniformly.",
        "No report print view relies on responsive Tailwind breakpoint classes in a way that reverts to a single-column mobile layout during printing.",
        "From the Resident Profile page, printing the Resident Profile Report, MAR Report, and ADL Report yields consistent widths, table/grid alignment, and header spacing across desktop and mobile/tablet."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (shadcn/ui components are read-only).",
    "Do not edit any frontend paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new report types or new report data endpoints.",
    "Changing report content/fields or backend report generation logic.",
    "Introducing third-party printing libraries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}