{
  "kind": "build_request",
  "title": "Rollback production deployment to Version 85",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Roll back the deployed application to Version 85 by checking out the repository state that corresponds to \"Version 85\" (tag/branch/commit used for that release) and redeploying to the Internet Computer (ic) network.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "revert to version 85"
        ]
      },
      "acceptanceCriteria": [
        "The codebase used for the deployment is confirmed to be the exact repository state corresponding to Version 85 (document the git ref/commit hash used).",
        "A successful `dfx deploy --network ic` is performed from the Version 85 code state without build/deploy errors.",
        "The deployment produces timestamped artifacts in `frontend/deployment_logs/` including a deploy log (`deploy_[timestamp].log`) and canister ID summary (`canister_ids_[timestamp].txt`)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Perform the rollback deployment using the clean rebuild workflow to minimize the risk of stale frontend artifacts and cached canister-ID wiring in production.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "revert to version 85"
        ]
      },
      "acceptanceCriteria": [
        "The deployment is executed via `./frontend/scripts/clean_redeploy_production.sh` from the Version 85 code state (or an equivalent clean rebuild procedure matching that script’s behavior).",
        "After deployment, the `canister_ids_[timestamp].txt` file includes Frontend and Backend canister IDs plus build metadata (version, git commit, build time) and indicates a clean rebuild.",
        "No prior `frontend/dist` or Vite cache artifacts are reused for the production build (clean step completed)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify the rollback in production by running the post-deployment smoke tests and confirming the app is not stuck on \"Connecting to backend...\" and that diagnostics show valid build metadata and canister IDs.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "revert to version 85"
        ]
      },
      "acceptanceCriteria": [
        "Using `frontend/DEPLOYMENT_CHECKLIST.md`, the following pass in production: Login page load, Internet Identity authentication, Dashboard reaches a settled state within 10 seconds, and no console errors.",
        "The in-app diagnostics indicator shows a non-unknown frontend build identifier and a non-unknown backend canister ID.",
        "The backend canister ID shown in the diagnostics indicator matches the backend canister ID recorded in the latest `frontend/deployment_logs/canister_ids_[timestamp].txt`.",
        "Operator performs a hard refresh (and clears site cache if needed) and the app continues to function normally on the rolled-back version."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`; do not introduce additional backend services.",
    "Do not modify any frontend files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "This is a rollback/publish operation only; do not introduce new features, refactors, or UI changes beyond what exists in Version 85."
  ],
  "nonGoals": [
    "Implementing new application features or UI enhancements.",
    "Changing backend data models or performing schema migrations unless Version 85 explicitly requires it for existing stable state.",
    "Adding new deployment tooling beyond using the existing scripts and checklist."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}