{
  "kind": "build_request",
  "title": "Fix resident dashboard empty flash and persistent 'Connecting to backend' state",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Eliminate the persistent 'Connecting to backend...' state caused by actor initialization by ensuring resident/admin queries do not depend on the immutable `useActor` hook (which always calls `_initializeAccessControlWithSecret` even when the token is empty). Update data-fetching hooks used by the Dashboard/Resident pages to use the resilient actor pattern (timeouts + best-effort admin init only when a non-empty token exists), so the app either loads data or surfaces a recoverable error state instead of hanging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "shown an empty resident dashboard then stucked on connecting to backend persists again"
        ]
      },
      "acceptanceCriteria": [
        "After login, the Dashboard no longer shows an empty residents list due to queries being disabled while the actor is still initializing.",
        "If backend actor creation or access-control initialization fails/blocks, the UI transitions to an explicit error state (via existing startup/error handling patterns) rather than remaining indefinitely on 'Connecting to backend...'.",
        "Resident list queries execute successfully using the resilient actor when the backend is healthy, without requiring any URL admin token."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent the Dashboard from rendering a misleading empty state while resident/admin queries are still loading or not yet enabled due to actor initialization. Update the Dashboard page UI logic to show a clear loading state (or skeleton) until queries have actually fetched (or errored), and to show a clear error message when resident queries fail/time out.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "shown an empty resident dashboard then stucked on connecting to backend persists again"
        ]
      },
      "acceptanceCriteria": [
        "When the backend is slow, the Dashboard shows a loading indicator instead of empty resident cards/empty-state content.",
        "When resident queries time out or error, the Dashboard shows an error message with a user-actionable recovery option (e.g., retry) rather than silently showing no residents.",
        "When resident queries succeed but there are genuinely zero residents, the Dashboard shows the empty-state messaging only after the query is fetched successfully."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend exposes a public, non-authenticated health check method compatible with the frontend startup diagnostics (`performHealthCheck` calls `healthCheck()`). If missing, add a `public query func healthCheck()` that returns a simple record including at least a human-readable message and a timestamp.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "stucked on connecting to backend persists again"
        ]
      },
      "acceptanceCriteria": [
        "Calling `healthCheck()` from an anonymous actor succeeds without requiring Internet Identity authentication.",
        "The frontend health check no longer fails due to a missing backend method, and can reliably distinguish 'backend reachable' vs 'backend unreachable/stopped' scenarios."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in `frontend/src/hooks/useActor.ts` or any other path listed in `frontend.immutablePaths`; implement fixes by updating call sites and/or adding new hooks/utilities in editable locations.",
    "Keep all backend logic in the single Motoko actor (`backend/main.mo`) per the project architecture."
  ],
  "nonGoals": [
    "Implementing real-time connectivity (WebSockets) or push updates.",
    "Adding new authentication providers beyond Internet Identity.",
    "Changing resident domain features (add/edit/discharge/delete) beyond fixing the loading/connection behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}