{
  "kind": "build_request",
  "title": "Add combined resident print report with active/discontinued medication tables and optional physician signature lines",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Implement a combined print report for a resident that includes (1) resident profile information and (2) separate table sections for Active Medications and Discontinued Medications, using the resident’s existing medication status values to determine which table each medication appears in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "print report must show resident profile, active medications and discontinued medications (in tables format separately)"
        ]
      },
      "acceptanceCriteria": [
        "When printing the combined report for a resident, the print output includes a Resident Information/profile section.",
        "The print output includes an “Active Medications” section rendered as a table, containing only medications with status = active.",
        "The print output includes a “Discontinued Medications” section rendered as a separate table, containing only medications with status = discontinued.",
        "If there are no medications in a section, the section renders a clear empty-state message (e.g., “No active medications prescribed” / “No discontinued medications”)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add an on-screen checkbox or toggle available before printing that controls whether the combined print report includes blank underline fields for “Physician Name” and “Physician Signature” intended for manual completion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "toggle to print with Physician's Name and Signature",
          "on-screen checkbox or toggle before printing",
          "just blank underline that they can manual write"
        ]
      },
      "acceptanceCriteria": [
        "On the resident screen where the print action is initiated, there is a clearly labeled toggle/checkbox (English text) that controls inclusion of physician signature fields in the printed report.",
        "When the toggle is OFF, the printed report does not show physician name/signature underline fields.",
        "When the toggle is ON, the printed report includes two blank lines/underline fields labeled “Physician Name” and “Physician Signature” (no prefilled values)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Ensure the combined print report uses the existing shared print stylesheet conventions (e.g., the existing print root container and print utility classes) so the fixed-width @media print override applies consistently across desktop and mobile/tablet printing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "combined print report"
        ]
      },
      "acceptanceCriteria": [
        "The combined print report’s printable root container opts into the shared print styles so that the global fixed-width print override applies.",
        "Printing from mobile/tablet produces the same fixed-width desktop-style layout as desktop printing (no responsive reflow in the printed output)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/immutablePaths (compose existing hooks and shadcn/ui components instead).",
    "Backend must remain a single Motoko actor; only add migration handling if state layout changes (not expected for this request).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new backend fields to store physician name/signature; the signature fields must be blank lines for manual completion.",
    "Do not change medication data models or statuses; only use existing active/discontinued status to split tables.",
    "Do not add a third-party e-signature or digital signing workflow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}