{
  "kind": "build_request",
  "title": "Backend fix: allow unregistered users to fetch null profile and reach Profile Setup",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend user-profile lookup so a first-time (unregistered) authenticated caller does not receive an error for profile load. The `getCallerUserProfile` call must return `null`/`?UserProfile = null` when the caller has no saved profile, rather than throwing/trapping or returning an error like \"User is not registered\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please spply backend fix"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getCallerUserProfile()` for a principal with no profile returns `null` (Motoko `null`) and does not trap.",
        "The backend no longer produces the error message \"User is not registered\" for the first-time profile lookup path."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure that a newly authenticated principal can complete initial profile setup without requiring prior registration/role assignment. Specifically, backend authorization must allow a first-time caller to (a) call `getCallerUserProfile()` and receive `null`, and (b) call `saveCallerUserProfile(profile)` successfully to create their profile (without an admin needing to pre-register them).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please spply backend fix"
        ]
      },
      "acceptanceCriteria": [
        "A principal that has never interacted with the canister can call `saveCallerUserProfile` once to create their profile without hitting an authorization trap.",
        "After saving, `getCallerUserProfile()` returns the saved profile for that principal."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic within the existing single-actor backend (backend/main.mo).",
    "Only add a migration (backend/migration.mo) if the change requires state/schema upgrade; otherwise, do not add migration code."
  ],
  "nonGoals": [
    "No UI/UX changes to the Profile Setup screen or startup error screen.",
    "No changes to resident/physician/pharmacy/insurance domain logic beyond what is necessary to fix the user profile registration flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}