{
  "kind": "build_request",
  "title": "Fix Dashboard resident discharge action not working",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Fix the Dashboard “Discharge” resident action so that it reliably updates the resident status to Discharged and the UI immediately reflects the change (resident moves out of Active list and appears in Discharged list) after the mutation succeeds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "discharge option not working"
        ]
      },
      "acceptanceCriteria": [
        "From the Dashboard, clicking “Discharge” on an Active resident results in the resident showing as Discharged in the UI (badge updates and resident appears in the Discharged tab) without requiring a manual page refresh.",
        "The Active, All, and Discharged resident queries are refreshed/invalidated in a way that guarantees the updated resident appears in the correct tab(s) after discharge completes successfully.",
        "The Discharge button shows an in-progress state only for the resident being discharged (or otherwise does not block unrelated resident actions unnecessarily)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add explicit error handling for the Dashboard “Discharge” action so failures are visible to the user and include a clear message when the caller is not authorized (admin-only operation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "discharge option not working"
        ]
      },
      "acceptanceCriteria": [
        "If discharging fails, the UI shows a user-facing error message in English (e.g., toast or inline alert) instead of failing silently.",
        "If the backend returns an unauthorized/admin-only error, the user-facing message explicitly indicates that only admins can discharge residents.",
        "After a discharge failure, the UI remains usable and the resident lists remain consistent (no incorrect tab movement)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update the Dashboard resident card action visibility/availability to prevent non-admin users from attempting admin-only actions (Discharge and Archive), while keeping View Profile available to all authenticated users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "discharge option not working"
        ]
      },
      "acceptanceCriteria": [
        "When the logged-in user is not an admin, the Discharge and Archive actions are not shown (or are shown disabled with clear admin-only labeling) on resident cards.",
        "When the logged-in user is an admin, the Discharge and Archive actions remain available and function as expected.",
        "User-facing text for any disabled/admin-only state is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose these components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration logic if a stable state layout change is required."
  ],
  "nonGoals": [
    "Do not change the business rule that discharging residents is an admin-only operation unless explicitly requested.",
    "Do not add new resident lifecycle features (e.g., changing the 1-month auto-archive policy) as part of this fix.",
    "Do not redesign the Dashboard UI beyond what is necessary to make Discharge work and to communicate errors/permissions clearly."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}