{
  "kind": "build_request",
  "title": "Fix live backend connection so residents load (stuck on “Connecting to backend…”)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a public, unauthenticated backend health check method that the frontend can call during startup, and ensure it always returns quickly with a stable response shape (including a message and timestamp).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "please fix backed. residents not showing on the live application. just stucked on the connecting to backend"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a public query method named healthCheck that does not require authentication/authorization.",
        "healthCheck returns an object containing at least a human-readable message and a timestamp.",
        "Calling healthCheck from an anonymous actor succeeds when the canister is deployed and running."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend supports the startup/admin initialization call used by the frontend resilient actor, and that failures in admin initialization do not prevent normal authenticated users from connecting and reading residents when they have the required permissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "please fix backed. residents not showing on the live application. just stucked on the connecting to backend"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a method compatible with the frontend call actor._initializeAccessControlWithSecret(secret).",
        "If access control initialization is not performed (or is performed with an invalid/expired secret), normal actor creation and non-admin read flows do not hang; they either succeed or fail fast with an explicit error."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove infinite/long-lived loading states in the live app by ensuring resident-loading queries fail fast with clear errors (instead of leaving the UI stuck on “Connecting to backend…”), and provide a user-visible retry path that re-runs actor creation and resident queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "just stucked on the connecting to backend",
          "start again"
        ]
      },
      "acceptanceCriteria": [
        "When the backend cannot be reached or is misconfigured, the app transitions from the loading screen to an error screen (or error state) within the configured startup timeouts and does not remain indefinitely on “Connecting to backend…”.",
        "A visible Retry action re-attempts backend connection and re-fetches residents after a failure.",
        "If the backend is reachable and the user has permissions, the Dashboard loads and displays residents instead of remaining in a connecting state."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make resident list fetching resilient by using the same resilient actor/connection strategy used during startup for Dashboard resident queries, so the live app consistently loads residents even under slow backend initialization conditions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "residents not showing on the live application"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard resident queries use an actor creation path that has explicit timeouts and returns actionable errors on failure (rather than silently stalling).",
        "When backend responsiveness is slow (but reachable), the UI either loads residents successfully or shows an explicit slow-backend error state with retry, rather than leaving the resident list empty without explanation."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose them instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to backend connectivity and resident loading.",
    "Introducing external databases, third-party auth providers, or additional backend services.",
    "Implementing real-time updates (WebSockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}