{
  "kind": "build_request",
  "title": "Fix missing resident profiles after login (data persistence + UI error handling)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Identify and fix the root cause of resident records becoming unavailable after login by auditing backend resident persistence and retrieval paths so resident data cannot be unintentionally lost, overwritten with partial data, or become unreachable after deployments/upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "resident profiles are now missing after logging in"
        ]
      },
      "acceptanceCriteria": [
        "After logging in as an authorized user, `getAllResidents`, `getActiveResidents`, and `getDischargedResidents` return the expected residents (not an empty list) when residents exist in canister state.",
        "Backend update flows that modify nested resident data (e.g., medication/vitals/MAR/ADL/weight updates) do not drop unrelated resident fields (no partial overwrite bugs).",
        "Resident removal is only possible via the existing admin-only path and cannot be triggered indirectly by other mutations."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Ensure resident data and required related state persists reliably across canister upgrades by implementing stable-state upgrade handling (e.g., preupgrade/postupgrade) for residents, user profiles, and all relevant next-ID counters; add a conditional migration if the stable layout changes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "resident profiles are now missing after logging in"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the backend canister does not reset or clear residents, user profiles, or ID counters; resident lists remain intact after upgrade.",
        "New residents created after an upgrade continue using correct incrementing IDs (no ID reuse/collisions).",
        "If a migration is required due to a state layout change, it runs conditionally and preserves existing data."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add an admin-only backend diagnostics query for production verification of resident data integrity without exposing sensitive resident details (return aggregate counts and ID/counter metadata, and optionally a small non-sensitive sample such as resident IDs and room numbers).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "resident profiles are now missing after logging in"
        ]
      },
      "acceptanceCriteria": [
        "There is a new admin-only query that returns at least: total resident count, active count, discharged count, and the next resident ID counter value.",
        "The diagnostics query does not return resident names, DOB, notes, medication details, or other sensitive fields.",
        "Non-admin callers are rejected (trap/unauthorized) when invoking the diagnostics query."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the Dashboard resident list UX to distinguish between “no residents exist” and “failed to load residents” by handling React Query error states for resident list queries and providing a clear retry action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "resident profiles are now missing after logging in"
        ]
      },
      "acceptanceCriteria": [
        "If any resident list query (all/active/discharged) fails, the Dashboard displays an explicit error message in English (instead of showing “No residents found”).",
        "The error UI includes a user-invokable retry control that triggers refetching/invalidation of the relevant resident queries.",
        "When the backend returns an actual empty list successfully, the existing “No residents found” empty state continues to display."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (no additional backend services).",
    "Create/modify backend/migration.mo only when needed by state layout changes, and keep migrations conditional per the project migration policy.",
    "Do not edit frontend files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new resident management features beyond fixing missing data and improving load/error visibility.",
    "Introducing external databases or non-Motoko backend components.",
    "Implementing third-party auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}