{
  "kind": "build_request",
  "title": "Fix backend data loss: resident profiles intermittently disappear",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Identify and fix the backend cause of resident profiles “disappearing” by auditing all resident persistence and retrieval paths (create/update/delete/query) to ensure resident records cannot be unintentionally removed, overwritten with partial data, or become unreachable.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "review and fix backend. resident's profiles disappear"
        ]
      },
      "acceptanceCriteria": [
        "Reproduction steps are documented (what action(s) cause residents to disappear, e.g., canister upgrade, specific mutation, or authorization/init flow).",
        "After applying the fix, repeating the previously documented reproduction steps no longer causes resident records to disappear.",
        "All resident-mutating functions preserve existing nested arrays/fields unless explicitly intended (e.g., medication edits must not drop MAR/ADL/vitals/weight history).",
        "If a resident is missing, backend returns a consistent not-found behavior (no silent failure), and logs/diagnostics (if added) indicate why."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure resident data (and any required related state such as ID counters and user profiles) persists reliably across canister upgrades by implementing stable-state upgrade handling (preupgrade/postupgrade) and adding/using a conditional migration in the backend migration file if the stable layout changes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "resident's profiles disappear"
        ]
      },
      "acceptanceCriteria": [
        "After a canister upgrade, `getAllResidents()` returns the same residents as before the upgrade (no loss of resident records).",
        "After a canister upgrade, creating new residents continues with correct non-colliding IDs (ID counters are restored correctly).",
        "If migration is required, it is implemented in the designated migration file (per project architecture) and is conditional (only runs when upgrading existing state).",
        "Upgrade flow does not trap for existing deployments that already have data."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add an admin-only backend diagnostics query to support verifying data integrity in production without exposing sensitive resident data (e.g., return counts and next-ID counters, and optionally a small sample of resident IDs/room numbers).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "review and fix backend. resident's profiles disappear"
        ]
      },
      "acceptanceCriteria": [
        "A new admin-only query exists that returns: total resident count, counts for active/discharged, and the next-id counters relevant to residents and embedded records.",
        "The diagnostics endpoint does not return full resident PHI/PII fields (no names, DOB, insurance numbers, notes, etc.).",
        "Non-admin callers receive an authorization error when calling the diagnostics endpoint.",
        "Endpoint can be used to confirm (before/after upgrade) that resident counts are unchanged."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic remains in backend/main.mo (migration code only in the designated backend migration file if needed).",
    "Do not introduce additional backend services, external databases, or non-Motoko backend code."
  ],
  "nonGoals": [
    "Frontend/UI changes (unless strictly necessary to surface a backend error state already returned).",
    "Adding new resident features or changing the resident data model beyond what is required to prevent data loss."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}