{
  "kind": "build_request",
  "title": "Fix missing discharge and permanently delete actions in production dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the production (live) build renders the admin-only Resident actions (Discharge, Archive, Delete) on the Dashboard for authenticated administrators, matching Version 105 behavior.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "updated discharge and delete actions are not available in the live app"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as an admin user in production, each active resident card shows a visible Discharge button and each resident card shows a visible Delete button (in addition to Archive).",
        "Clicking Discharge updates the resident status to discharged and moves the resident from Active to Discharged lists without requiring a hard refresh.",
        "Clicking Delete permanently removes the resident and the resident no longer appears in any resident list after the mutation completes.",
        "No console error occurs related to missing actor methods (e.g., 'isCallerAdmin method not found', 'dischargeResident method not found', 'permanentlyDeleteResident method not found')."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make admin-permission gating failures explicit in the Dashboard UI so that if the admin check cannot be completed (e.g., backend incompatibility or authorization query failure), the UI clearly explains why Discharge/Delete actions are unavailable and provides a one-click retry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "updated discharge and delete actions are not available in the live app"
        ]
      },
      "acceptanceCriteria": [
        "If the admin check query errors, the Dashboard shows a prominent, user-readable error state indicating admin actions may not be available and includes a Retry action.",
        "If the admin check query fails due to missing backend methods (compatibility issue), the Dashboard error message explicitly states that the backend appears out of date/incompatible.",
        "The absence of Discharge/Delete buttons is always explainable by one of: (a) user is not an admin, or (b) admin check is still loading, or (c) admin check failed and an error banner is visible."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight production diagnostics indicator (visible in the app UI) that displays the currently running frontend build identifier/version and the backend canister ID the frontend is connected to, to help confirm the live app is actually serving Version 105 and pointing at the expected backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "updated discharge and delete actions are not available in the live app"
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard (or a globally accessible area) displays a frontend build identifier (e.g., a version string) and the backend canister ID currently in use.",
        "The diagnostics indicator is readable but unobtrusive (e.g., small text in footer/header) and uses English labels.",
        "The values update appropriately between local/dev and production builds and do not require backend changes to render."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Verify and align backend interface compatibility for Version 105 so that production backend exposes the admin and resident lifecycle methods used by the frontend (at minimum: isCallerAdmin, dischargeResident, permanentlyDeleteResident) and that the generated frontend declarations match the deployed backend candid.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "updated discharge and delete actions are not available in the live app"
        ]
      },
      "acceptanceCriteria": [
        "The deployed backend canister used by production includes callable methods for admin check and resident discharge/delete that match the frontend actor expectations.",
        "The frontend build does not ship with stale declarations that omit these methods when connecting to production.",
        "A production smoke check confirms the admin check succeeds and returns true for an admin principal, enabling the admin actions UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep all backend logic within the single Motoko actor in backend/main.mo; add backend/migration.mo only if state migration is required."
  ],
  "nonGoals": [
    "Adding new resident lifecycle states beyond active/discharged.",
    "Implementing a new authentication provider (Internet Identity only).",
    "Introducing external databases or non-IC backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}