{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Dashboard Discharge action refresh, permissions, and errors",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Make Dashboard “Discharge” reliably update resident status and immediately reflect changes across Active/All/Discharged tabs after success, with per-resident in-progress state.",
      "acceptanceCriteria": [
        "From the Dashboard, clicking “Discharge” on an Active resident results in the resident showing as Discharged in the UI (badge updates and resident appears in the Discharged tab) without requiring a manual page refresh.",
        "The Active, All, and Discharged resident queries are refreshed/invalidated in a way that guarantees the updated resident appears in the correct tab(s) after discharge completes successfully.",
        "The Discharge button shows an in-progress state only for the resident being discharged (or otherwise does not block unrelated resident actions unnecessarily)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the discharge mutation success handling to explicitly invalidate/refetch the specific resident lists used by the Dashboard (['residents','all'], ['residents','active'], ['residents','discharged']) as well as the individual resident query, ensuring post-mutation UI consistency without manual refresh."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Adjust the Discharge action UI to track and render an in-progress state per resident (e.g., by keeping a local dischargingResidentId) so only the clicked resident shows loading/disabled state; ensure UI updates rely on the post-success query refresh so the resident moves between tabs immediately after success."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add user-visible error handling for Dashboard “Discharge”, including clear admin-only/unauthorized messaging, while keeping lists consistent after failure.",
      "acceptanceCriteria": [
        "If discharging fails, the UI shows a user-facing error message in English (e.g., toast or inline alert) instead of failing silently.",
        "If the backend returns an unauthorized/admin-only error, the user-facing message explicitly indicates that only admins can discharge residents.",
        "After a discharge failure, the UI remains usable and the resident lists remain consistent (no incorrect tab movement)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/actorInit.ts",
          "operation": "modify",
          "description": "Extend/centralize frontend error normalization (without changing auth hooks) so authorization failures coming from backend traps can be consistently identified by message content (e.g., contains 'Unauthorized') for downstream UI messaging."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add explicit error handling around the Discharge action: display a user-facing error (prefer toast via the existing sonner Toaster, or an inline Alert) on failure; detect unauthorized/admin-only errors and show an English message indicating only admins can discharge residents; ensure failure does not optimistically move residents between tabs and that loading state is cleared for the attempted resident."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Hide or disable admin-only resident card actions (Discharge, Archive) for non-admin users while keeping View Profile available to authenticated users.",
      "acceptanceCriteria": [
        "When the logged-in user is not an admin, the Discharge and Archive actions are not shown (or are shown disabled with clear admin-only labeling) on resident cards.",
        "When the logged-in user is an admin, the Discharge and Archive actions remain available and function as expected.",
        "User-facing text for any disabled/admin-only state is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook to fetch whether the caller is an admin (using the authorization capability already exposed by the backend, e.g., isCallerAdmin/getCallerUserRole) so the Dashboard can conditionally render admin-only actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Use the authorization component’s role-based access control signal (via the new admin-status hook) to conditionally hide or disable Discharge and Archive actions for non-admin users with clear English admin-only labeling, while keeping View Profile available to all authenticated users. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}