{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore admin resident actions in production Dashboard with explicit gating + diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Discharge/Archive/Delete admin-only resident actions render and work reliably in production, including immediate list updates after mutations.",
      "acceptanceCriteria": [
        "When logged in as an admin user in production, each active resident card shows a visible Discharge button and each resident card shows a visible Delete button (in addition to Archive).",
        "Clicking Discharge updates the resident status to discharged and moves the resident from Active to Discharged lists without requiring a hard refresh.",
        "Clicking Delete permanently removes the resident and the resident no longer appears in any resident list after the mutation completes.",
        "No console error occurs related to missing actor methods (e.g., 'isCallerAdmin method not found', 'dischargeResident method not found', 'permanentlyDeleteResident method not found')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden admin + resident lifecycle hooks for production: avoid calling missing actor methods; add compatibility fallbacks for discharge/delete (e.g., prefer current methods, but if unavailable use Version-105 compatible methods exposed on the actor); ensure successful mutations invalidate/refetch resident lists so Active/Discharged tabs update without refresh."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure admin-only actions are rendered based on the resolved admin-gating state and that post-mutation UX triggers appropriate React Query updates (no hard refresh). Keep Discharge visible only for active residents, and Delete visible for all residents for admins."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Expose admin-permission gating failures in the Dashboard with a clear compatibility/error message and one-click retry so missing actions are always explainable.",
      "acceptanceCriteria": [
        "If the admin check query errors, the Dashboard shows a prominent, user-readable error state indicating admin actions may not be available and includes a Retry action.",
        "If the admin check query fails due to missing backend methods (compatibility issue), the Dashboard error message explicitly states that the backend appears out of date/incompatible.",
        "The absence of Discharge/Delete buttons is always explainable by one of: (a) user is not an admin, or (b) admin check is still loading, or (c) admin check failed and an error banner is visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Improve useIsCallerAdmin to (1) detect compatibility issues (missing method) and (2) fall back to an alternate admin determination strategy available in declarations (e.g., role query) when possible; classify errors so the UI can distinguish 'not admin' vs 'check failed' vs 'backend incompatible' without console method-not-found errors."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update the Dashboard admin-gating UI to show: loading state, explicit 'not an admin' explanation when admin check succeeds false, and an error banner with clear compatibility wording when the admin check fails (including missing-method detection) plus a one-click Retry that re-runs the admin check."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an unobtrusive in-app production diagnostics indicator showing frontend build identifier/version and the backend canister ID in use (no backend changes).",
      "acceptanceCriteria": [
        "The Dashboard (or a globally accessible area) displays a frontend build identifier (e.g., a version string) and the backend canister ID currently in use.",
        "The diagnostics indicator is readable but unobtrusive (e.g., small text in footer/header) and uses English labels.",
        "The values update appropriately between local/dev and production builds and do not require backend changes to render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/buildInfo.ts",
          "operation": "create",
          "description": "Add a small utility to derive a frontend build identifier/version from build-time environment (e.g., Vite env variables) with sensible fallbacks for local/dev, without requiring backend changes."
        },
        {
          "path": "frontend/src/components/DiagnosticsIndicator.tsx",
          "operation": "create",
          "description": "Create a lightweight UI component that displays English-labeled diagnostics: frontend build identifier/version (from buildInfo) and backend canister ID (from existing getBackendDiagnostics()). Use existing UI primitives (compose; do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Render the DiagnosticsIndicator in an unobtrusive location on the Dashboard (e.g., header/footer area) so it is visible in production for confirmation of frontend build + connected backend canister ID. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Align frontend runtime behavior with Version 105 backend interface expectations by adding compatibility handling and surfacing mismatches, preventing stale-declaration/method-missing failures in production UI paths.",
      "acceptanceCriteria": [
        "The deployed backend canister used by production includes callable methods for admin check and resident discharge/delete that match the frontend actor expectations.",
        "The frontend build does not ship with stale declarations that omit these methods when connecting to production.",
        "A production smoke check confirms the admin check succeeds and returns true for an admin principal, enabling the admin actions UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement runtime interface-compatibility guards for admin/discharge/delete flows: prefer current actor methods when present, otherwise fall back to Version-105 compatible methods if present; when neither exists, throw a clearly worded 'backend appears out of date/incompatible' error that the UI can display (and avoid raw method-not-found console errors)."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "When compatibility errors occur (admin check or mutations), display a clear, user-readable message indicating the backend appears out of date/incompatible and provide a one-click retry; optionally include minimal diagnostic context (e.g., connected canister ID via existing diagnostics helper) to support production smoke checks."
        }
      ]
    }
  ]
}