{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fail-fast backend connection and resilient resident loading with retry",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure resident loading fails fast (no indefinite “Connecting to backend…”) and provide a visible Retry that re-runs actor creation and resident queries.",
      "acceptanceCriteria": [
        "When the backend cannot be reached or is misconfigured, the app transitions from the loading screen to an error screen (or error state) within the configured startup timeouts and does not remain indefinitely on “Connecting to backend…”.",
        "A visible Retry action re-attempts backend connection and re-fetches residents after a failure.",
        "If the backend is reachable and the user has permissions, the Dashboard loads and displays residents instead of remaining in a connecting state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the startup Retry handler to fully reset resident-loading state by clearing/invalidation of resident-related React Query caches (in addition to the existing resilient-actor + profile queries), so a Retry re-runs actor creation and subsequent resident queries rather than reusing potentially stuck cache state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Wrap resident-list query functions in explicit timeouts and normalized error handling (using existing withTimeout/normalizeError) so resident-loading requests fail fast with actionable errors instead of stalling indefinitely."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure the Dashboard surfaces a clear error state when resident queries fail (including timeout/misconfiguration cases) and that the existing Retry action triggers a full re-attempt (refetch + any needed cache invalidation) for the currently visible resident list."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make Dashboard resident fetching use the resilient actor/connection strategy with explicit timeouts and actionable errors under slow backend initialization.",
      "acceptanceCriteria": [
        "Dashboard resident queries use an actor creation path that has explicit timeouts and returns actionable errors on failure (rather than silently stalling).",
        "When backend responsiveness is slow (but reachable), the UI either loads residents successfully or shows an explicit slow-backend error state with retry, rather than leaving the resident list empty without explanation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/startupTimings.ts",
          "operation": "modify",
          "description": "Add and centralize resident-query timing constants (e.g., resident list fetch timeout and/or slow-backend thresholds) so Dashboard resident loading can fail fast and present a consistent slow-backend/error experience."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Introduce resilient resident list hooks (or update existing resident list hooks) to use the resilient actor path (useResilientActor) for Dashboard reads, including explicit timeouts and consistent error messages, while keeping non-Dashboard flows unchanged where appropriate."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Wire Dashboard resident queries to the resilient resident hooks so resident fetching benefits from the same resilient actor creation strategy as startup; ensure loading/error/slow-backend states are clearly communicated and include a retry path."
        }
      ]
    }
  ]
}