{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable admin discharge and permanent delete actions from Dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expose clear admin-only Dashboard controls for discharging and permanently deleting residents with explicit labels, confirmations, and live list updates via existing React Query mutations.",
      "acceptanceCriteria": [
        "When logged in as an admin, each active resident card in the Dashboard shows an actionable control to discharge the resident.",
        "When logged in as an admin, each resident card in the Dashboard shows an actionable control to permanently delete the resident (not hidden behind ambiguous/unlabeled UI).",
        "Attempting to permanently delete prompts a confirmation dialog that clearly states the action is irreversible.",
        "After a successful discharge, the resident no longer appears in the Active tab and appears in the Discharged tab without requiring a manual page refresh.",
        "After a successful permanent delete, the resident disappears from all dashboard lists without requiring a manual page refresh.",
        "If the caller is not an admin, the dashboard does not allow discharge/delete actions and shows an English error/toast message if an action is attempted by any means."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update resident cards to provide explicit, clearly labeled admin actions for Discharge and Permanent Delete (avoid icon-only affordances for delete). Use the existing shadcn-ui AlertDialog component to add confirmation dialogs, including irreversible wording for permanent delete, and (optionally) a confirmation for discharge. Add a defensive admin gate in the discharge/delete handlers (in addition to hiding controls) so non-admin attempts trigger an English toast and no mutation call is made. Ensure successful mutations rely on React Query cache invalidation so Active/Discharged/All lists update without manual refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure useDischargeResident and usePermanentlyDeleteResident invalidate the specific resident list queries used by the Dashboard (e.g., active/discharged/all) so tab contents refresh immediately after success. Keep using the existing mutations (useDischargeResident, usePermanentlyDeleteResident) and ensure errors propagate so the Dashboard can show English toasts for authorization and other failures."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Validate that frontend backend bindings and authorization checks support isCallerAdmin, dischargeResident, and permanentlyDeleteResident without runtime binding mismatches, and make the Dashboard resilient to authorization/binding failures.",
      "acceptanceCriteria": [
        "The frontend can successfully call isCallerAdmin and receives the expected boolean for an admin principal.",
        "The frontend can successfully call dischargeResident and permanentlyDeleteResident for an admin principal.",
        "Non-admin principals receive an authorization error from dischargeResident and permanentlyDeleteResident.",
        "No runtime errors occur due to missing actor methods or mismatched candid/bindings when loading the Dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Verify the generated frontend backend bindings include isCallerAdmin, dischargeResident, and permanentlyDeleteResident with correct names and return types, and correct any mismatches that would cause runtime errors when the Dashboard loads or calls these functions (keep changes limited to binding/type alignment)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden authorization/admin-check integration by adding safe, user-meaningful error handling for isCallerAdmin/dischargeResident/permanentlyDeleteResident calls (e.g., clear English errors when actor methods are unavailable or authorization traps occur), while preserving existing Internet Identity flow. Ensure hook-level failures do not crash the Dashboard render path."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Handle admin-check loading/error states explicitly so the Dashboard does not crash or incorrectly hide actions due to transient binding/authorization issues; default to non-admin behavior on admin-check failure and surface an English toast/banner if appropriate. Keep discharge/delete execution wired to the existing React Query mutations."
        }
      ]
    }
  ]
}