{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback deployment support for Version 85 (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure rollback redeploy artifacts clearly document the exact Version 85 repository state used (git ref/commit) and preserve timestamped logs.",
      "acceptanceCriteria": [
        "The codebase used for the deployment is confirmed to be the exact repository state corresponding to Version 85 (document the git ref/commit hash used).",
        "A successful `dfx deploy --network ic` is performed from the Version 85 code state without build/deploy errors.",
        "The deployment produces timestamped artifacts in `frontend/deployment_logs/` including a deploy log (`deploy_[timestamp].log`) and canister ID summary (`canister_ids_[timestamp].txt`)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/redeploy_production.sh",
          "operation": "modify",
          "description": "Augment the production redeploy script to capture and persist the repository state used for the deployment (e.g., current commit hash and a human-friendly ref such as tag/branch/describe output) into both the deploy log and the generated canister IDs summary, so operators can document the exact Version 85 git ref/commit used."
        },
        {
          "path": "frontend/scripts/clean_redeploy_production.sh",
          "operation": "modify",
          "description": "Augment the clean redeploy script to capture and persist the repository state used for the deployment (e.g., current commit hash and a human-friendly ref such as tag/branch/describe output) into both the deploy log and the generated canister IDs summary, so operators can document the exact Version 85 git ref/commit used."
        },
        {
          "path": "frontend/DEPLOYMENT_CHECKLIST.md",
          "operation": "modify",
          "description": "Update the checklist to explicitly require recording the Version 85 git ref/commit used for the rollback (as written by the deployment scripts into frontend/deployment_logs artifacts) and to reference the expected location/format in the latest canister_ids_[timestamp].txt."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reinforce the clean rebuild rollback workflow to prevent stale frontend artifacts and ensure canister-ID wiring/build metadata are captured as proof of a clean build.",
      "acceptanceCriteria": [
        "The deployment is executed via `./frontend/scripts/clean_redeploy_production.sh` from the Version 85 code state (or an equivalent clean rebuild procedure matching that script’s behavior).",
        "After deployment, the `canister_ids_[timestamp].txt` file includes Frontend and Backend canister IDs plus build metadata (version, git commit, build time) and indicates a clean rebuild.",
        "No prior `frontend/dist` or Vite cache artifacts are reused for the production build (clean step completed)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/clean_redeploy_production.sh",
          "operation": "modify",
          "description": "Strengthen the canister_ids_[timestamp].txt output to include explicit clean-rebuild build metadata (version, git commit, build time) plus a clear 'clean rebuild' indicator and the list of cleaned artifact paths, so the artifact itself demonstrates that frontend/dist and Vite caches were not reused."
        },
        {
          "path": "frontend/DEPLOYMENT_CHECKLIST.md",
          "operation": "modify",
          "description": "Clarify/align the documented clean rebuild procedure with the current clean_redeploy_production.sh behavior, including how to confirm the clean step completed and where to verify the 'clean rebuild' marker and build metadata in the latest canister_ids_[timestamp].txt."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make post-deploy rollback verification repeatable by aligning checklist and helper script with the required production smoke tests and diagnostics cross-checks.",
      "acceptanceCriteria": [
        "Using `frontend/DEPLOYMENT_CHECKLIST.md`, the following pass in production: Login page load, Internet Identity authentication, Dashboard reaches a settled state within 10 seconds, and no console errors.",
        "The in-app diagnostics indicator shows a non-unknown frontend build identifier and a non-unknown backend canister ID.",
        "The backend canister ID shown in the diagnostics indicator matches the backend canister ID recorded in the latest `frontend/deployment_logs/canister_ids_[timestamp].txt`.",
        "Operator performs a hard refresh (and clears site cache if needed) and the app continues to function normally on the rolled-back version."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_CHECKLIST.md",
          "operation": "modify",
          "description": "Ensure the checklist explicitly directs operators to (1) verify the app is not stuck on 'Connecting to backend...' (dashboard settles within 10 seconds), (2) verify diagnostics build identifier/canister ID are non-unknown, (3) cross-check the backend canister ID against the latest frontend/deployment_logs/canister_ids_[timestamp].txt, and (4) perform a hard refresh / cache clear and re-verify stability."
        },
        {
          "path": "frontend/scripts/post_deploy_smoke_test_helper.sh",
          "operation": "modify",
          "description": "Align the interactive smoke test helper with the rollback acceptance checks by adding/strengthening prompts for: confirming no 'Connecting to backend...' hang, validating diagnostics indicator build metadata is non-unknown, validating backend canister ID matches the latest canister_ids_[timestamp].txt, and confirming a hard refresh/cache clear does not break the rolled-back app."
        }
      ]
    }
  ]
}