{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Deployment target is the public Internet Computer (not local dfx); shell scripts like restart_backend_canister.sh cannot be executed from this environment."
  ],
  "known_issues": [
    "User registration fails with error: \"Unable to register user: Please contact an administrator to provision your account.\""
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-adjust-the-frontend-startup-registration-profile-bootstrap-so-it-no-longer-blocks-first-time-authenticated-users-behind-the-message-unable-to-register-user-please-contact-an-administrator-to-provision-your-account-when-baseline-registration-should-succeed",
      "title": "Adjust the frontend startup registration/profile bootstrap so it no longer blocks first-time authenticated users behind the message \"Unable to register user: Please contact an administrator to provision your account.\" when baseline registration should succeed.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update backend user registration so authenticated users can successfully complete baseline registration without requiring an administrator-provisioned token, while keeping any existing admin-token flow for admin provisioning intact.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Ensure backend error signaling for registration failures is specific and stable (e.g., anonymous caller, truly unauthorized admin-only operation), so the frontend can distinguish between provisioning issues and other failures; do not emit the generic provisioning message for normal first-time authenticated users.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix baseline user registration failing with provisioning error",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}